{"chunks": ["Presentation Title: Unit 10: Building Websites using Joomla\n\nSlide 1:\nTitle: Unit 10: Building Websites using Joomla\nContent: Unit 10: Building Websites using Joomla\nBy: Asst.Prof . Ms. Leena Divkar\nS.V.’s Sridora Caculo College of Commerce & Management Studies, Mapusa Goa\n\nSlide 2:\nTitle: Installing Joomla\nContent: Installing Joomla\nJoomla installation components:\n\nSlide 3:\nTitle: Step 1: Installation of XAMPP\nContent: Step 1: Installation of XAMPP\nGo to:\n click on download\n\nSlide 4:\nTitle: Step 1: Installation of XAMPP\nContent: Follow the steps and install XAMPP\nGo to browser & type localhost/phpMyAdmin\nCreate a database\nStep 1: Installation of XAMPP\n\nSlide 5:\nTitle: Step 2: Installation of Joomla\nContent: Step 2: Installation of Joomla\nGo to:\nClick on \n\n", "MPP\nGo to browser & type localhost/phpMyAdmin\nCreate a database\nStep 1: Installation of XAMPP\n\nSlide 5:\nTitle: Step 2: Installation of Joomla\nContent: Step 2: Installation of Joomla\nGo to:\nClick on \n\nSlide 6:\nTitle: Step 2: Installation of Joomla\nContent: Copy Joomla folder in xampp htdocsnew_folder\nExtract Joomla File\nGo to the browser & type: localhost/ new_folder\nAdd all the details in the configuration section like: select language, site name, add description, site offlineNO\nStep 2: Installation of Joomla\n\nSlide 7:\nTitle: Step 2: Installation of Joomla\nContent: Add administrator email, username, password  Click on Next\nStep 2: Installation of Joomla\n\nSlide 8:\nTitle: Step 2: Installation of Joomla\nContent: In database configuration, select:\n database type MYSQLi\nHostnamelocalhost\nUsername root\nPasswordkeep blank\nBackupnext\nStep 2: Installation of Joomla\n\n", "le: Step 2: Installation of Joomla\nContent: In database configuration, select:\n database type MYSQLi\nHostnamelocalhost\nUsername root\nPasswordkeep blank\nBackupnext\nStep 2: Installation of Joomla\n\nSlide 9:\nTitle: Step 2: Installation of Joomla\nContent: In the overview section: Sample data select as Default English and click on Install\n After that remove installation folder\nStep 2: Installation of Joomla\n\nSlide 10:\nTitle: Joomla Website First Page\nContent: Joomla Website First Page\nGo to browser & type: localhost/ new_folder\n\nSlide 11:\nTitle: References:\nContent: References:\nhttps ://youtu.be/08s1vfU-lmc", "Presentation Title: Slide 1\n\nSlide 1:\n\nSlide 2:\nContent: If you want to build a website online with minimal effort and maximum creative freedom, look no further than Wix . It offers standout features, such as online storage for your site assets, e-commerce tools, cool video backgrounds, title animations etc.\n\nSlide 3:\nTitle: How To Work With Wix?\nContent: How To Work With Wix ?\nWix is a website builder, an easy-to-use tool that lets you quickly create an online presence via a drag-and-drop interface, no coding knowledge is required . All you need is an email address.\nAfter creating an account, you search for a general site type business , designer, event, blog, and so on and then choose whether you want to use a site template or have Wix automatically create a site for you using Artificial Design Intelligence ( ADI)\n\n", "e type business , designer, event, blog, and so on and then choose whether you want to use a site template or have Wix automatically create a site for you using Artificial Design Intelligence ( ADI)\n\nSlide 4:\nContent: Wix Editor is a platform that you can use to create and edit your own sites. It employees innovative drag and drop technology which allows you to easily add or change elements on your site and has many design options. \n\nSlide 5:\nTitle: Setting up WIX account\nContent: Setting up WIX account\nFirst you need to open this link on your web browser.\nThen click on start now to create an account\n\nSlide 6:\nTitle: Setting up WIX account\nContent: Setting up WIX account\nThen just fill up all your details and click on sign up.\nOr you can also sign up using Google or Facebook account\n\nSlide 7:\nTitle: Setting up WIX account\nContent: Setting up WIX account\n And then your account will be created.\n\n", "details and click on sign up.\nOr you can also sign up using Google or Facebook account\n\nSlide 7:\nTitle: Setting up WIX account\nContent: Setting up WIX account\n And then your account will be created.\n\nSlide 8:\nTitle: Laying Out Pages Using Template Features\nContent: Laying Out Pages Using Template Features\n\nSlide 9:\nTitle: To add pages to the site click on Menus & Pages\nContent: To add pages to the site click on Menus & Pages\n\nSlide 10:\nTitle: Then select where you want to add the page and click on + Add Page\nContent: Then select where you want to add the page and click on + Add Page\n\nSlide 11:\nTitle: Then select a page from the available templates and click on Add Page.\nContent: Then select a page from the available templates and click on Add Page .\n\n", "page and click on + Add Page\n\nSlide 11:\nTitle: Then select a page from the available templates and click on Add Page.\nContent: Then select a page from the available templates and click on Add Page .\n\nSlide 12:\nTitle: Choose a Template (Design)\u000b\nContent: Choose a Template (Design)\nWix tries to make the design selection process as straightforward as possible, so instead of showing you a wall of hundreds of templates to choose from, it begins by asking just about the style of design that you prefer. \n\nSlide 13:\nContent: We choose a template called breeze.\nAs soon as you make a choice, you’ll see that Wix puts together pretty accurate homepage alternatives to pick from. Based on your previous selections, these homepages will be pre-filled with relevant graphics and adhere to a given design style. \n\n", "ix puts together pretty accurate homepage alternatives to pick from. Based on your previous selections, these homepages will be pre-filled with relevant graphics and adhere to a given design style. \n\nSlide 14:\nTitle: Adding New Sections\u000b\u000b\nContent: Adding New Sections \nyou can add new sections . To do so, click on the  Add  button that’s in the top menu, and then click on  “Section to Page.”\n\nSlide 15:\nContent: You’ll see that there’s really a lot of different content sections to pick from. sections come pre-categorized:\nYou can grab any section from the sidebar and drag-and-drop it onto the canvas to the right.\n\nSlide 16:\nTitle: Setting Fonts And Colors\u000b\nContent: Setting Fonts And Colors\nWhen you get started with the Wix ADI editor, you’ll get a pre-defined color scheme and font settings.\nyou can change them easily to get a more fine-tuned look.\nTo do so, click on the  Design  button in the top menu and then on  Colors .\n\n", "ditor, you’ll get a pre-defined color scheme and font settings.\nyou can change them easily to get a more fine-tuned look.\nTo do so, click on the  Design  button in the top menu and then on  Colors .\n\nSlide 17:\nContent: The same thing goes for your fonts. Start with the same  Design  button in the top menu, and select  Fonts .\n\nSlide 18:\nTitle: Adding Site Content Features\nContent: Adding Site Content Features\n Open the Add panel and click Add Elements + on the left of\n the editor \n\nSlide 19:\nTitle: Adding Site Content Features\nContent: Adding Site Content Features\n Click Content Manager . \n\nSlide 20:\nTitle: Adding Site Content Features\nContent: Adding Site Content Features\n Select a preset or click Custom to start from scratch.\n\n", "t: Adding Site Content Features\n Click Content Manager . \n\nSlide 20:\nTitle: Adding Site Content Features\nContent: Adding Site Content Features\n Select a preset or click Custom to start from scratch.\n\nSlide 21:\nTitle: Adding A Link To Text\nContent: Adding A Link To Text\nAdd links to text from the text settings panel. You can link to an entire text block, or just specific parts. Some popular text links include \"Read More \" or \"Buy Now \".\nTo link text:\nClick the text element in your Editor.\nClick Edit Text.\nHighlight the relevant text.\nClick the Link icon     .\nSelect a link type. and enter the link details.\nClick Done.\n\nSlide 22:\nTitle: Types Of Links\nContent: Types Of Links\nThere are a many types of links you can add to your elements to direct your site visitors to whatever content you like; including links to lightboxes , anchors, and external URLS .  \n\n", " Types Of Links\nThere are a many types of links you can add to your elements to direct your site visitors to whatever content you like; including links to lightboxes , anchors, and external URLS .  \n\nSlide 23:\nTitle: Adding A Link To An Element\nContent: Adding A Link To An Element\nAdd links to a variety of elements including images, buttons, and vector art .\nTo add a link to an element:\nClick the Link icon  .\nSelect the link type and enter the details.\nClick  Done\n\n", " An Element\nAdd links to a variety of elements including images, buttons, and vector art .\nTo add a link to an element:\nClick the Link icon  .\nSelect the link type and enter the details.\nClick  Done\n\nSlide 24:\nTitle: Adding A Link To Your Menu\nContent: Adding A Link To Your Menu\nYour site menu contains items that link to pages or page sections on your site. However, you can also link a menu item to another destination. \nThese links look like regular menu items, and you can name them whatever you like.\nTo link a menu item:\n1. Click Menus & Pages on the left side of the Editor\n2.Click the Add a Link icon      .\nSelect the link type and enter the link details. \nChoose whether your link opens in a new window or the current window. \nClick Done.\nEnter the name for the menu item. \n\n", "Slide 25:\nTitle: \u000b\u000bTune-Up Your Site For Mobile Devices\u000b\u000b\nContent: Tune-Up Your Site For Mobile Devices \nThese days, mobile phones are often people’s primary devices for accessing the web. \nIn fact, more people use mobiles than desktops and laptops combined. \nYou absolutely must make sure that your website looks properly on mobile! If you fail at that, people will leave and probably never come back.\nMoreover, if you happen to be running a local business, the impact of mobile is even bigger. \nVarious “near me” searches make up a big chunk of the overall local traffic on Google, and being able to serve those users quickly is of utmost importance if you want to earn their business.\nFor instance, imagine you running the aforementioned massage parlor. If someone searches  “massage near me”  and your site comes up but it fails to load on their phone, then that would-be customer will not come to you.\n\n", "e you running the aforementioned massage parlor. If someone searches  “massage near me”  and your site comes up but it fails to load on their phone, then that would-be customer will not come to you.\n\nSlide 26:\nContent: Getting your site mobile-optimized with Wix is easy. To begin, click on the view switcher button that’s in the top bar. This one:\nThis will reload the page and show you how it’s going to appear on mobile devices.\n\nSlide 27:\n\n", "optimized with Wix is easy. To begin, click on the view switcher button that’s in the top bar. This one:\nThis will reload the page and show you how it’s going to appear on mobile devices.\n\nSlide 27:\n\nSlide 28:\nContent: Most crucially, any changes you make here won’t affect the way your site looks on the desktop. This is mobile-only!\nHere’s what you can do that’s generally going to make your site better on mobile:\nhide images that aren’t crucial and just take up space on the mobile view\nput your contact info higher up on the page – people want to get to that quickly\nhighlight only your main product or service\nWix lets you customize really a lot here regarding hiding different elements on the page, realigning entire sections, and so on. \nWhen you’re done, just switch to  desktop view  again. Your changes will be saved automatically.\n\n", "y a lot here regarding hiding different elements on the page, realigning entire sections, and so on. \nWhen you’re done, just switch to  desktop view  again. Your changes will be saved automatically.\n\nSlide 29:\nTitle: CMS Development Using WIX\nContent: CMS Development Using WIX\nWix provides a quick and easy platform to design a website for your business with little to no techincal experience.\nWix also maintains the site, fixing any security or other problems that might emerge.\nAn additional benefit is the low cost of getting started\n\nSlide 30:\nTitle: CMS Development Using WIX \nContent: CMS Development Using WIX \nWIX is a website builder. It is intended to make creating a website quick and easy.\nThat means it doesn’t require any knowledge of coding and is made specifically for people with minimal web experience.\nYou can build a website for free.\n\n", "ed to make creating a website quick and easy.\nThat means it doesn’t require any knowledge of coding and is made specifically for people with minimal web experience.\nYou can build a website for free.\n\nSlide 31:\nTitle: CMS Development Using WIX \nContent: CMS Development Using WIX \nI t’s probably best suited to small businesses, which don’t intend to grow exponentially.\nIt provides various website templates, with handy drag and drop designs to fill in with your business’s content. All of this makes web designing quick.\n\nSlide 32:\nTitle: References\nContent: References -your-site\n\nSlide 33:\nTitle: THANKYOU\nContent: THANKYOU", "Presentation Title: Website Design using CSS\n\nSlide 1:\nTitle: Website Design using CSS\nContent: Website Design using CSS\n\nSlide 2:\nTitle: Cascading Style Sheet\nContent: Cascading Style Sheet\nCSS stands for  Cascading Style Sheet.  It gives an additional style to the HTML document. A cascading style sheet is a language that is designed to define the document f o rmatting and look written in a markup language. Generally, CSS is applied with HTML documents to change various styles of user interfaces and web pages.\n\nSlide 3:\nTitle: Uses of CSS\u000b\nContent: Uses of CSS\nWe can add unique styles to our old documents of HTML.\nWe can change the overall look and feel of our website by following some changes in the CSS code.\nA cascading style sheet can be used with JavaScript and HTML in most of the websites to develop user interfaces for a lot of mobile applications and user interfaces for various web applications.\n\n", "Slide 4:\nTitle: Features of CSS\u000b\nContent: Features of CSS\nOpportunity in Web designing:  If anyone wants to begin a career in web designing professionally, it is essential to have knowledge of CSS and HTML.\nWebsite Design:  With the use of CSS, we can control various styles, such as the text color, the font style, the spacing among paragraphs, column size and layout, background color and images, design of the layout, display variations for distinct screens and device sizes, and many other effects as well.\nWeb Control:  CSS has controlling power on the documents of HTML, so it is easy to learn. It is integrated with the HTML and the XHTML markup languages.\nOther Languages:  Once we have knowledge of some basics of CSS and HTML, other associated technologies like Angular, PHP, and JavaScript are become clearer to understand.\n\n", "the XHTML markup languages.\nOther Languages:  Once we have knowledge of some basics of CSS and HTML, other associated technologies like Angular, PHP, and JavaScript are become clearer to understand.\n\nSlide 5:\nTitle: CSS Applications\u000b\nContent: CSS Applications\nFast Page Loading:  We don’t need to mention the attributes of the HTML element every time if we use CSS. We need to specify one rule of CSS for an element and use it for every occurrence of that element.  So, short code means high-speed download times.\nEasy Maintenance:  To create a global alteration we need to alter the style. Every element will get automatically updated within all web pages.\n\n", "Slide 6:\nTitle: Cont…\nContent: Cont…\nSuperior HTML Styles:  HTML contains few extended attribute’s array than CSS, thus we can provide a much better view to our HTML page as compared to HTML attributes.\nSave Time:  We can specify CSS once and reuse the same sheet within various HTML pages. We can describe a style for every HTML tag and apply this style to as a lot of web pages as we want.\nCompatibility:  The cascading style sheet permits content to be upgraded for one or more device types. Distinct versions of the website could be granted for various handheld devices like cell phones and PDAs, and for printing.\nGlobal Standards:  Now, the attributes of HTML are being recommended to apply CSS, and they are being deprecated. Thus it is better to begin the use of CSS in every HTML page for making them compatible for future browsers.\n\nSlide 7:\nTitle: Changing of the text color\nContent: Changing of the text color\n\nSlide 8:\nTitle: Cont…\nContent: Cont…\n\n", "he use of CSS in every HTML page for making them compatible for future browsers.\n\nSlide 7:\nTitle: Changing of the text color\nContent: Changing of the text color\n\nSlide 8:\nTitle: Cont…\nContent: Cont…\n\nSlide 9:\nTitle: CSS Syntax\u000b\nContent: CSS Syntax\nThe CSS syntax contains the selector and the declaration block, which will be clearer with the following example:\nSelector:  A CSS selector specifies the HTML tag we wish to style. A selector can be any element such as , and .\n\nSlide 10:\nTitle: Syntax\nContent: Syntax\nDeclaration Block:  This block can consist of more than one declaration that is isolated by the semicolon. Here, there are two types of declarations for the example as mentioned above:\nColor: red;\nFont-size: 12px;\n  All the declarations include the property name and the value that are isolated by the colon.\n\n", "e, there are two types of declarations for the example as mentioned above:\nColor: red;\nFont-size: 12px;\n  All the declarations include the property name and the value that are isolated by the colon.\n\nSlide 11:\nTitle: Cont…\nContent: Cont…\nProperty:  It is a part of the HTML element’s attributes. A property could be any color or border.\nValue:  CSS properties are required to be assigned by some values. Thus, values are provided to the properties of CSS. Value “red” is given to the color property in the example, as mentioned above.\n\nSlide 12:\nContent: Explanation of Example:\nP is the selector.\nColor is the property.\nThe value of the property is green.\nAnother property is text-align.\nThe value of the property is left.\n\nSlide 13:\nTitle: TEXT Features\nContent: TEXT Features\n\n", " is the selector.\nColor is the property.\nThe value of the property is green.\nAnother property is text-align.\nThe value of the property is left.\n\nSlide 13:\nTitle: TEXT Features\nContent: TEXT Features\n\nSlide 14:\nTitle: CSS Layout - The position Property\u000b\nContent: CSS Layout - The position Property\nThe position property specifies the type of positioning method used for an element (static, relative, fixed, absolute or sticky).\n\nSlide 15:\nTitle: The position Property\u000b\nContent: The position Property\nThe position property specifies the type of positioning method used for an element.\nThere are five different position values:\nstatic\nrelative\nfixed\nabsolute\nsticky\n\n", "ty\u000b\nContent: The position Property\nThe position property specifies the type of positioning method used for an element.\nThere are five different position values:\nstatic\nrelative\nfixed\nabsolute\nsticky\n\nSlide 16:\nTitle: position: static;\u000b\nContent: position: static;\nHTML elements are positioned static by default.\nStatic positioned elements are not affected by the top, bottom, left, and right properties.\nAn element with position: static; is not positioned in any special way; it is always positioned according to the normal flow of the page:\n\nSlide 17:\nTitle: Cont…\nContent: Cont…\n\nSlide 18:\nTitle: position: relative;\u000b\nContent: position: relative;\nAn element with position: relative; is positioned relative to its normal position.\nSetting the top, right, bottom, and left properties of a relatively-positioned element will cause it to be adjusted away from its normal position. Other content will not be adjusted to fit into any gap left by the element.\n\nSlide 19:\nTitle: Cont…\nContent: Cont…\n\n", "vely-positioned element will cause it to be adjusted away from its normal position. Other content will not be adjusted to fit into any gap left by the element.\n\nSlide 19:\nTitle: Cont…\nContent: Cont…\n\nSlide 20:\nTitle: position: fixed;\u000b\nContent: position: fixed;\nAn element with position: fixed; is positioned relative to the viewport, which means it always stays in the same place even if the page is scrolled. The top, right, bottom, and left properties are used to position the element.\nA fixed element does not leave a gap in the page where it would normally have been located.\nNotice the fixed element in the lower-right corner of the page. Here is the CSS that is used:\n\nSlide 21:\nTitle: Cont…\nContent: Cont…\n\n", "eave a gap in the page where it would normally have been located.\nNotice the fixed element in the lower-right corner of the page. Here is the CSS that is used:\n\nSlide 21:\nTitle: Cont…\nContent: Cont…\n\nSlide 22:\nTitle: position: absolute;\u000b\nContent: position: absolute;\nAn element with position: absolute; is positioned relative to the nearest positioned ancestor (instead of positioned relative to the viewport, like fixed).\nHowever; if an absolute positioned element has no positioned ancestors, it uses the document body, and moves along with page scrolling.\nNote:  Absolute positioned elements are removed from the normal flow, and can overlap elements.\n\nSlide 23:\nTitle: Cont…\nContent: Cont…\n\ndiv.relative {\n position: relative;\n width: 400px;\n height: 200px;\n border: 3px solid #73AD21;\n} \ndiv.absolute {\n position: absolute;\n top: 80px;\n right: 0;\n width: 200px;\n height: 100px;\n border: 3px solid #73AD21;\n}\n\n", "ition: relative;\n width: 400px;\n height: 200px;\n border: 3px solid #73AD21;\n} \ndiv.absolute {\n position: absolute;\n top: 80px;\n right: 0;\n width: 200px;\n height: 100px;\n border: 3px solid #73AD21;\n}\n\nSlide 24:\nTitle: position: sticky;\u000b\nContent: position: sticky;\nAn element with position: sticky; is positioned based on the user's scroll position.\nA sticky element toggles between relative and fixed, depending on the scroll position. It is positioned relative until a given offset position is met in the viewport - then it \"sticks\" in place (like position:fixed).\n\nSlide 25:\n\nSlide 26:\nTitle: Text on image\nContent: Text on image\n\nSlide 27:\nTitle: Output\nContent: Output\n\nSlide 28:\nTitle: Positioning Properties\u000b\nContent: Positioning Properties\n\n", " position:fixed).\n\nSlide 25:\n\nSlide 26:\nTitle: Text on image\nContent: Text on image\n\nSlide 27:\nTitle: Output\nContent: Output\n\nSlide 28:\nTitle: Positioning Properties\u000b\nContent: Positioning Properties\n\nSlide 29:\nTitle: What are CSS Animations?\u000b\nContent: What are CSS Animations?\nAn animation lets an element gradually change from one style to another.\nYou can change as many CSS properties you want, as many times as you want.\nTo use CSS animation, you must first specify some keyframes for the animation.\nKeyframes hold what styles the element will have at certain times.\n\nSlide 30:\nTitle: properties:\nContent: properties:\n@keyframes\nanimation-name\nanimation-duration\nanimation-delay\nanimation-iteration-count\nanimation-direction\nanimation-timing-function\nanimation-fill-mode\n\n", "e 30:\nTitle: properties:\nContent: properties:\n@keyframes\nanimation-name\nanimation-duration\nanimation-delay\nanimation-iteration-count\nanimation-direction\nanimation-timing-function\nanimation-fill-mode\n\nSlide 31:\nTitle: The @keyframes Rule\u000b\nContent: The @keyframes Rule\nWhen you specify CSS styles inside the @keyframes rule, the animation will gradually change from the current style to the new style at certain times.\nTo get an animation to work, you must bind the animation to an element.\nThe following example binds the \"example\" animation to the element. The animation will last for 4 seconds, and it will gradually change the background-color of the element from \"red\" to \"yellow\":\n\nSlide 32:\nTitle: CSS Animation\nContent: CSS Animation\n\nSlide 33:\nTitle: animation-duration\nContent: animation-duration\n\nSlide 34:\nTitle: animation-delay\nContent: animation-delay\n\n", " \"red\" to \"yellow\":\n\nSlide 32:\nTitle: CSS Animation\nContent: CSS Animation\n\nSlide 33:\nTitle: animation-duration\nContent: animation-duration\n\nSlide 34:\nTitle: animation-delay\nContent: animation-delay\n\nSlide 35:\nTitle: Run Animation in Reverse Direction or Alternate Cycles\u000b\nContent: Run Animation in Reverse Direction or Alternate Cycles\nThe animation-direction property specifies whether an animation should be played forwards, backwards or in alternate cycles.\nThe animation-direction property can have the following values:\nnormal - The animation is played as normal (forwards). This is default\nreverse - The animation is played in reverse direction (backwards)\nalternate - The animation is played forwards first, then backwards\nalternate-reverse - The animation is played backwards first, then forwards\n\n", "The animation is played in reverse direction (backwards)\nalternate - The animation is played forwards first, then backwards\nalternate-reverse - The animation is played backwards first, then forwards\n\nSlide 36:\nTitle: Example\u000b\nContent: Example\ndiv {   width: 100px;   height: 100px;   position: relative;   background-color: red;   animation-name: example;   animation-duration: 4s;   animation-direction: reverse; }\n\n", "Example\u000b\nContent: Example\ndiv {   width: 100px;   height: 100px;   position: relative;   background-color: red;   animation-name: example;   animation-duration: 4s;   animation-direction: reverse; }\n\nSlide 37:\nTitle: Specify the Speed Curve of the Animation\u000b\nContent: Specify the Speed Curve of the Animation\nThe animation-timing-function property specifies the speed curve of the animation.\nThe animation-timing-function property can have the following values:\nease - Specifies an animation with a slow start, then fast, then end slowly (this is default)\nlinear - Specifies an animation with the same speed from start to end\nease-in - Specifies an animation with a slow start\nease-out - Specifies an animation with a slow end\nease-in-out - Specifies an animation with a slow start and end\ncubic-bezier(n,n,n,n) - Lets you define your own values in a cubic-bezier function\n\n", "rt\nease-out - Specifies an animation with a slow end\nease-in-out - Specifies an animation with a slow start and end\ncubic-bezier(n,n,n,n) - Lets you define your own values in a cubic-bezier function\n\nSlide 38:\nTitle: Example\u000b\nContent: Example\n#div1 {animation-timing-function: linear;} #div2 {animation-timing-function: ease;} #div3 {animation-timing-function: ease-in;} #div4 {animation-timing-function: ease-out;} #div5 {animation-timing-function: ease-in-out;}\n\n", "Slide 39:\nTitle: Specify the fill-mode For an Animation\u000b\nContent: Specify the fill-mode For an Animation\nCSS animations do not affect an element before the first keyframe is played or after the last keyframe is played. The animation-fill-mode property can override this behavior.\nThe animation-fill-mode property specifies a style for the target element when the animation is not playing (before it starts, after it ends, or both).\nThe animation-fill-mode property can have the following values:\nnone - Default value. Animation will not apply any styles to the element before or after it is executing\nforwards - The element will retain the style values that is set by the last keyframe (depends on animation-direction and animation-iteration-count)\nbackwards - The element will get the style values that is set by the first keyframe (depends on animation-direction), and retain this during the animation-delay period\n", " and animation-iteration-count)\nbackwards - The element will get the style values that is set by the first keyframe (depends on animation-direction), and retain this during the animation-delay period\nboth - The animation will follow the rules for both forwards and backwards, extending the animation properties in both directions\n\n", "Slide 40:\nTitle: Animation Shorthand Property\u000b\nContent: Animation Shorthand Property\ndiv {   animation-name: example;   animation-duration: 5s;   animation-timing-function: linear;   animation-delay: 2s;   animation-iteration-count: infinite;   animation-direction: alternate; }\n\nSlide 41:\nTitle: CSS Properties\nContent: CSS Properties\n\nSlide 42:\nTitle: Creating Website\nContent: Creating Website\n\nSlide 43:\nTitle: Questions\nContent: Questions\nWhat is CSS?\nWhat are the uses of CSS?\nWhat are the features of CSS?\nWhat are the application of CSS?\nWhat is the syntax of CSS?\nExplain selector in CSS?\nWhat are different text features IN CSS?\nExplain position property in CSS?\nExplain CSS Animation properties?\n\nSlide 44:\nTitle: References\nContent: References\n1.\n2.\n3.\n4.\n5.", "By: Asst. Prof Myrtle Fernandes\nFr. Agnel College of Arts & Commerce,\nPilar-Goa\nUNIT 2\nPLANNING AND DEVELOPING \nDYNAMIC WEB CONTENT SITES \n\nTOPICS\n- Setting site goals \n- Identifying target audiences \n- Wire framing and planning site \n- Function and flow \n- Installing CMS applications \n- Working with ISPs to add site features to servers. \n- Working with MySQL and backend data structures. \n\nSETTING SITE GOALS\n- drive traffic, engage prospects, generate \nleads and re-engage existing customers\nMarketing\n- help close sales by validating and supporting \nsales team communications\nSales\n- improve customer satisfaction through better \nservice\nCustomer Support\n\nSETTING SITE GOALS\n- simplify and optimize content updates and \nwebsite management\nWebmasters\n- integrate with other systems; meet security, \nperformance and scalability requirements\nIT Website Goals\n- reduce costs by streamlining and automating \nworkflows and tasks\nOperations\n\n", "ent\nWebmasters\n- integrate with other systems; meet security, \nperformance and scalability requirements\nIT Website Goals\n- reduce costs by streamlining and automating \nworkflows and tasks\nOperations\n\nSETTING SITE GOALS\n- attract and recruit new employees and support \ncurrent employees\nHR\n- grow the company’s bottom line and increase \nprofitability\nC-Suite\n\nIDENTIFYING TARGET AUDIENCES \nTargeted marketing allows you to focus your message on the right market – and\nthe people who are most likely to buy from you. With a target audience definition\nto work with, you can spend less on customer acquisition costs, and earn more by\nreaching the most valuable leads in your network.\nLearning how to identify target audience personas ensures that you can take\nyour brand to market in the most cost-effective and efficient way.\n\n", "re by\nreaching the most valuable leads in your network.\nLearning how to identify target audience personas ensures that you can take\nyour brand to market in the most cost-effective and efficient way.\n\nIDENTIFYING TARGET AUDIENCES \n1. Choose a \ntarget \naudience you \ncan relate to\n2. Decide \nbetween B2B \nand B2C \ncustomers\n3. Design a \nuser persona \nas a team\n5. Use tools to \nhelp you\n4. Look at the \nlong-term \npotential of \neach target \naudience\n\n3 examples how modern companies \ndo target audience\nVideo Source:\n1. Nike target audience\nSerena Williams starred in a \nadvertisement for Nike called \n“Until We All Win”. \nThe ad is all about \nencouraging and supporting \nwomen who don’t always get \ntheir chance in the athletic \nworld.\n\n", "ce\nSerena Williams starred in a \nadvertisement for Nike called \n“Until We All Win”. \nThe ad is all about \nencouraging and supporting \nwomen who don’t always get \ntheir chance in the athletic \nworld.\n\n3 examples how modern companies \ndo target audience\nImage Source:\ncontent/uploads/Target-Audience-Definition-61920x1200.jpg\n2. Netflix target audience\nThey decided to use \ncompression technology to \nstart streaming content, \ninstead of sending it in the \nmail. \nThey appealed to a target \naudience of trendsetters and \npeople who wanted a unique, \ndifferent experience.\n\n3 examples how modern companies \ndo target audience\nImage Source:\ncontent/uploads/Target-Audience-Definition-71920x1200.jpg\n3. BBC target audience\nThey launched “BBC Trust”. \nThis group works out what \ncustomers want by listening to \nthe views of users, \ncommissioning independent \nstudies, and evaluating viewer \nstatistics.\n\nWIREFRAMING AND PLANNING SITE\n\n", "ed “BBC Trust”. \nThis group works out what \ncustomers want by listening to \nthe views of users, \ncommissioning independent \nstudies, and evaluating viewer \nstatistics.\n\nWIREFRAMING AND PLANNING SITE\n\nWHAT IS A WIREFRAME?\nA wireframe is like a UX blueprint for your website. \nIt maps out certain features of your site, such as menus, \nbuttons, and layouts, while stripping away the visual \ndesign. \nThis gives you an idea of your site’s underlying functionality \nand navigation, without distracting elements such as its \ncolor scheme and content.\n\nEXAMPLE OF WIREFRAMING\nfront.net/en/wpcontent/uploads/old-bloguploads/versions/samuelstudent-wireframe---x---972-715x---.png\nImage Source\n\nPLANNING BEFORE YOU START \nWIREFRAMING\n1. Do your research\n2. Prepare your research for quick reference\n3. Make sure you have your user flow mapped out\n4. Draft, don’t draw. Sketch, don’t illustrate\n5. Add some detail and get testing\n6. Start turning your wireframes into prototypes\n\nFUNCTIONS AND FLOW\n\n", "3. Make sure you have your user flow mapped out\n4. Draft, don’t draw. Sketch, don’t illustrate\n5. Add some detail and get testing\n6. Start turning your wireframes into prototypes\n\nFUNCTIONS AND FLOW\n\nESSENTIAL WEBSITE FUNCTIONS ALL \nFIRMS SHOULD MONITOR\nRedirects\n- When a broken link is found, either remove the link, or, if applicable, redirect it to newer\ncontent.\nMeta \ndescriptions\n- The meta description is the snippet of text, usually around 160 characters, that appears \nbeneath the url in your search engine listing. \nWorking \nnavigation\n- Navigation can suffer the same fate as textual links. Pages move or become obsolete, \nand navigation must follow. In addition to making sure your navigation works, check \nregularly to ensure that your top links still take visitors to your most relevant pages. \n\nMETADATA\nchdio.nitrocdn.com/cfslLJaM\nNnOImIhHAZEQKUAeMsoFny\nDn/assets/static/optimized/re\nv-58deb65/wpcontent/uploads/metadescription.jpg\nImage Source\n\n", "ll take visitors to your most relevant pages. \n\nMETADATA\nchdio.nitrocdn.com/cfslLJaM\nNnOImIhHAZEQKUAeMsoFny\nDn/assets/static/optimized/re\nv-58deb65/wpcontent/uploads/metadescription.jpg\nImage Source\n\nESSENTIAL WEBSITE FUNCTIONS ALL \nFIRMS SHOULD MONITOR\nImage \noptimization\n- Check for Image compression and Alt Text\nCalls to action\n(CTA)\n- Website calls to action are critical to lead generation. Each \npage should contain a clear CTA relevant to that page.\nUp-to-date \ncontact details\n- Your phone number should be visible on every page, in text and \nnot in an image. This is especially critical for smartphone visitors.\n\n", "a clear CTA relevant to that page.\nUp-to-date \ncontact details\n- Your phone number should be visible on every page, in text and \nnot in an image. This is especially critical for smartphone visitors.\n\nESSENTIAL WEBSITE FUNCTIONS ALL \nFIRMS SHOULD MONITOR\nWorking \nforms\n- Always test forms regularly. Also, make sure any required input fields are\nclearly marked and that error messages for incorrectly filled fields are\nobvious.\nAnalytics\n- Every professional website should monitor visitors. Google Analytics is \nthe leader in this field; it is free, relatively easy to use and highly \ncustomizable.\nReadable \ncontent\n- Your content must answer questions, offer benefits and be clearly \ndirected at potential clients.\n\nREADABLE CONTENT\nchdio.nitrocdn.com/cfslLJaMNnO\nImIhHAZEQKUAeMsoFnyDn/assets\n/static/optimized/rev58deb65/wpcontent/uploads/line-height-2.jpg\nImage Source\n\n", "be clearly \ndirected at potential clients.\n\nREADABLE CONTENT\nchdio.nitrocdn.com/cfslLJaMNnO\nImIhHAZEQKUAeMsoFnyDn/assets\n/static/optimized/rev58deb65/wpcontent/uploads/line-height-2.jpg\nImage Source\n\nESSENTIAL WEBSITE FUNCTIONS ALL \nFIRMS SHOULD MONITOR\nInformation \nabout you\n- Bio pages are some of the most visited pages. Your potential clients want to\nknow with whom they will be working, and they are interested in more than a\nbulleted resume list.\nchdio.nitrocdn.com/cfslLJ\naMNnOImIhHAZEQKUAeM\nsoFnyDn/assets/static/opti\nmized/rev-58deb65/wpcontent/uploads/News_c\nenter_friend.png\nImage Source\n\nUSER FLOW\nUser flow is the steps a user takes to accomplish a task on your site.\nWhy You Need a User Flow Diagram?\nThe best way to capture user flow is with a diagram. One reason why you need a \nuser flow diagram is that it helps you to figure out how people interact with your \nsite when they need to complete an action. \n\n", "way to capture user flow is with a diagram. One reason why you need a \nuser flow diagram is that it helps you to figure out how people interact with your \nsite when they need to complete an action. \n\nUSER FLOW\nImage Source\np-content/webpexpress/webpimages/uploads/2020/09/guide\n-user-flow-charts1024x655.png.webp\n\n", "igure out how people interact with your \nsite when they need to complete an action. \n\nUSER FLOW\nImage Source\np-content/webpexpress/webpimages/uploads/2020/09/guide\n-user-flow-charts1024x655.png.webp\n\nBENEFITS OF USER FLOW DIAGRAM\nEvaluate \nyour \ncurrent \ncopy\n- When creating your new website is to evaluate your current copy. If this is your first\nwebsite, look for materials like existing brochures to establish what content is already\navailable.\n- Ask yourself three questions.\n- \nIs the content correct or still accurate?\n- \nIs anything missing?\n- \nIs it useful to my readers?\nDetermine \nyour target\naudience\n- Understanding, or at least identifying, who you are speaking to will help provide clarity \nas you plan the remainder of your content.\n- It may help to develop primary, secondary, and even tertiary audiences to make sure \nthat you take into account all of your visitors and their individual needs.\n\n", "BENEFITS OF USER FLOW DIAGRAM\nUse \nsitemaps as \ncopy \nblueprint\n- Start by thinking of the big buckets of content before getting too detailed. Can one \npage convey everything needed, or do you need subpages to give more detail?\n- Short, brief and clearly expressed.\n- \"use short, succinct sentences\" page titles do better in navigations than long phrases. \nBy taking this step, you can rearrange and prioritize your content before writing \nbegins.\nCollaborate \nwith Others\n- Even if you are the sole person in a business or if you work in an organization that \nrequires other stakeholders to weigh in or contribute, there are a variety of methods \nthat can help ease this pain. Try to avoid using one single file for all of your content, as \nthis doesn’t allow for easy collaboration.\n- Using Google Docs makes it easy to share a document for joint editing.\n\n", "lp ease this pain. Try to avoid using one single file for all of your content, as \nthis doesn’t allow for easy collaboration.\n- Using Google Docs makes it easy to share a document for joint editing.\n\nBENEFITS OF USER FLOW DIAGRAM\nUse \nStorytelling \nversus \n‘Storyselling’\n- Appeal to their problems by explaining your product or service as a solution. Provide\nclear benefits in easy-to-read bullets instead of paragraphs. Making your content\nuser-centered meets users’ needs and tells their story instead of just yours.\nWrite for \nHumans \nand Search \nEngines\n- For those of you who know the importance of writing your copy for SEO, don’t \nbecome too focused on injecting your key search terms so many times that the \ncontent becomes unreadable. \n- Also, by using “semantic keywords” you can develop a variety of words that provide \nthe same meaning around your core keywords.\n\nSEMANTIC KEYWORDS\nImage Source\ncontent/uploads/2018/05/SemanticKeyword-SEO-1.jpg.webp\n\n", "semantic keywords” you can develop a variety of words that provide \nthe same meaning around your core keywords.\n\nSEMANTIC KEYWORDS\nImage Source\ncontent/uploads/2018/05/SemanticKeyword-SEO-1.jpg.webp\n\nBENEFITS OF USER FLOW DIAGRAM\nMake the \nCopy Action \nOriented\n- Providing an email address or links to your contact page gives them an easy action to\ntake while your business is still top of mind.\nGive the \nCopy Visual \nAppeal\n- Break up your text up with supporting images, charts, or illustrations. \n- keep your paragraphs short and use sub-headings to divide sections.\n- Choose correct typeface plays a significant role in your copy’s legibility. \n\n", "ith supporting images, charts, or illustrations. \n- keep your paragraphs short and use sub-headings to divide sections.\n- Choose correct typeface plays a significant role in your copy’s legibility. \n\nBENEFITS OF USER FLOW DIAGRAM\nSet \nDeadlines\n- Set concrete deadlines to make sure your project stays on track. Grouping content creation\nactivities into relevant chunks ensures that you complete tasks on time.\n- Starting with the about section helps set the tone for your copy and assists in determining what \nkey differentiators to focus on throughout the site. Save the smaller, less copy-heavy pages like \ncontact and locations for the end.\n- Invest time in pre-planning and strategy, the process can be much easier. \n\nINSTALLING CMS APPLICATIONS \nSteps involved:\n1.\nPick Hosting Provider\n2.\nChoose Domain Name\n3.\nInstall WordPress\n\n", "he end.\n- Invest time in pre-planning and strategy, the process can be much easier. \n\nINSTALLING CMS APPLICATIONS \nSteps involved:\n1.\nPick Hosting Provider\n2.\nChoose Domain Name\n3.\nInstall WordPress\n\nINSTALLING CMS APPLICATIONS \nInstalling WordPress software on your web hosting account using an easy autoinstall option. It is available with most web hosting providers.\nUsing GoDaddy to hosting your CMS application:\nIf you don’t have an account GoDaddy, you will need to create one. For new\nusers GoDaddy offers a great way to get started, the WordPress hosting Basic plan\nwith a price as low as Rs. 199 per month. Before you start installing WordPress and\ncreating your first website, signup with one of the plans available.\n\nGODADDY PLANS\nImage Source\ngs&term=12&plan=wordpressopenexchange-forever-sslbasic&itc=dlp_wordpress_hosting\n\n", "alling WordPress and\ncreating your first website, signup with one of the plans available.\n\nGODADDY PLANS\nImage Source\ngs&term=12&plan=wordpressopenexchange-forever-sslbasic&itc=dlp_wordpress_hosting\n\nINSTALLING CMS APPLICATIONS \n1. Pick one of the products by \nclicking the “Add to Cart” button.\n2. Select term length (1 month, 12, \n24, or 36 months).\n3. Choose your domain name (a \nFree domain included with hosting \norder).\n4. Review your order and go through \nthe checkout process.\nWith the checkout process you will \nalso create the GoDaddy account.\nImage Source\nopenexchange-forever-ssl-basic&itc=dlp_wordpress_hosting\n\n", "\n4. Review your order and go through \nthe checkout process.\nWith the checkout process you will \nalso create the GoDaddy account.\nImage Source\nopenexchange-forever-ssl-basic&itc=dlp_wordpress_hosting\n\nINSTALLING CMS APPLICATIONS \nOnce, you have web hosting and a domain name. It’s time to install\nthe WordPress software. Depending on what type of hosting services\nyou’ve picked WordPress installation could be slightly different.\nIf you signed up with the Basic WordPress Managed hosting,\nGoDaddy will let you install WordPress and create your website via\nthe Quick Start Wizard process (handy to the first-time users).\nYou will have to follow the steps and answer a few questions to\nlaunch your WordPress website.\n\nINSTALLING CMS APPLICATIONS \nImage Source\ncontent/uploads/2020/07/godaddywordpress-setupwizard.jpg\n\n", "s).\nYou will have to follow the steps and answer a few questions to\nlaunch your WordPress website.\n\nINSTALLING CMS APPLICATIONS \nImage Source\ncontent/uploads/2020/07/godaddywordpress-setupwizard.jpg\n\nINSTALLING CMS APPLICATIONS \nHere are the steps you need to go through to install WordPress \nusing cPanel:\nLog in to your GoDaddy account.\nYou will see a list of all products and services.\nFind your web hosting account and click Manage to open cPanel.\nInside cPanel, under web applications, find and click on \nWordPress.\nOn the WordPress overview page click the “install this application \nbutton”.\nFill out the information about your website and click the “Install” \nbutton.\n\nINSTALLING CMS APPLICATIONS using \nGoDaddy\nSteps:\n\n", " WordPress overview page click the “install this application \nbutton”.\nFill out the information about your website and click the “Install” \nbutton.\n\nINSTALLING CMS APPLICATIONS using \nGoDaddy\nSteps:\n\nWORKING WITH ISPs TO ADD SITE \nFEATURES TO SERVERS\nA web hosting control panel is a web-based interface provided by\na web hosting service that allows users to manage their servers\nand hosted services.\nWeb hosting control panels usually include the following modules:\n- \nWeb server (e.g. Apache HTTP Server, Internet Information Services)\n- \nDomain Name System server\n- \nMail server and spam filter\n- \nFile Transfer Protocol server\n- \nDatabase\n- \nFile manager\n- \nSystem monitor\n- \nWeb log analysis software\n- \nFirewall\n- \nphpMyAdmin\n\nWORKING WITH ISPs TO ADD SITE \nFEATURES TO SERVERS\nSoftware\nSome web hosting control panels are:\n- \nCloudPanel\n- \ncPanel\n- \nDirectAdmin\n- \nInterWorx\n- \nISPConfig\n- \nPlesk\n- \nWebmin\n- \nAjenti\n- \nApisCP\n- \nMy20i\n- \naaPanel\n- \nWarren\n\n", "EATURES TO SERVERS\nSoftware\nSome web hosting control panels are:\n- \nCloudPanel\n- \ncPanel\n- \nDirectAdmin\n- \nInterWorx\n- \nISPConfig\n- \nPlesk\n- \nWebmin\n- \nAjenti\n- \nApisCP\n- \nMy20i\n- \naaPanel\n- \nWarren\n\nWORKING WITH MYSQL AND BACKEND \nDATA STRUCTURES\nThis involves an overview of servers, databases, routing, and anything else\nthat happens between when a client makes a request and receives a\nresponse.\nBack-end Architecture\nThe front-end is the code that is executed on the client side. This code\n(typically HTML, CSS, and JavaScript) runs in the user’s browser and creates\nthe user interface.\nThe back-end is the code that runs on the server, that receives requests from\nthe clients, and contains the logic to send the appropriate data back to the\nclient. The back-end also includes the database, which will persistently store\nall of the data for the application. The hardware and software on the serverside that make this possible.\n\n", "a back to the\nclient. The back-end also includes the database, which will persistently store\nall of the data for the application. The hardware and software on the serverside that make this possible.\n\nWORKING WITH MYSQL AND BACKEND \nDATA STRUCTURES\nThe back-end is all of the technology required to process the \nincoming request and generate and send the response to the \nclient. \nThis typically includes three major parts:\n1. The server. This is the computer that receives requests.\n2. The app. This is the application running on the server that listens for \nrequests, retrieves information from the database, and sends a \nresponse.\n3. The database. Databases are used to organize and persist data.\n\n", "QUESTION BANK\n1. Write a note on the different types of content organizers, on what basis do they set the \nsite goals? 3-5 marks\n2. How would you identify your target audience?3-5 marks\n3. List any three examples how modern companies target audience. 3 marks\n4. What is wire framing? 1-2 marks\n5. Draw wireframe design for Student/Restaurant/Hotel etc Home page/Login screen etc. \n2 marks\n6. Write down the steps of Planning before Wire framing? 3-5 marks\n7. What are the essential website functions all firms should monitor? 3-5 marks\n8. What is the aim of user low diagram? 1 mark\n9. Draw the user flow diagram for user registration/money transfer/contact us form. 3 \nmarks\n10.What are the benefits of user flow diagram? 5 marks\n11.What are the steps of installing a CMS application? 3 marks\n12.List modules which are included in web hosting control panel. 2 marks\n13.Write a note on the three major parts of backend data structures. 3 marks\n\n", "e steps of installing a CMS application? 3 marks\n12.List modules which are included in web hosting control panel. 2 marks\n13.Write a note on the three major parts of backend data structures. 3 marks\n\nREFERENCES\naudience\ndefinition/#:~:text=An%20age%2Dbased%20target%20audience,be%20\nthe%20person%20you%20target.&text=When%20you%20don't%20have,\nmarket%20as%20narrow%20as%20possible.1\nwireframe/#what-is-a-wireframe\nexamples/\n\nREFERENCES\nessential-website-functions-all-firms-should-monitor/", "Presentation Title: PowerPoint Presentation\n\nSlide 1:\nContent: STEFFY FERNANDES\nGVM’S GGPR COLLEGE OF COMMERCE & ECONOMICS\nPONDA-GOA\n\nSlide 2:\nContent: Moodle is an alternative to proprietary commercial online learning solutions, and is distributed free under open source licensing. An organization has complete access to the source code and can make changes if needed. Moodle's modular design makes it easy to create new courses, adding content that will engage learners.\n\nSlide 3:\nContent: Moodle is as interactive and helpful D teaching and learning as allow it to.\nYou have to think creatively to allow it to be of use to you and your students.\nLet the Moodle Learning Management System be your 365/24/7 teaching and learning aid.\nRequest new Moodle courses from the VSR.\n\nSlide 4:\n\n", "creatively to allow it to be of use to you and your students.\nLet the Moodle Learning Management System be your 365/24/7 teaching and learning aid.\nRequest new Moodle courses from the VSR.\n\nSlide 4:\n\nSlide 5:\nTitle: what do you want from an online learning system?\nContent: what do you want from an online learning system?\nEasy creation of courses from existing resources? \n Course content which can be re-used with different learners, including content from other vendors (Blackboard, WebCT etc.)?\n Learner involvement?\n Enrolment and learner authentication which is simple yet secure?\n Intuitive online learner and teacher management features?\n An active support community to help solve problems and generate new ideas?\n Affordability?\n\n", "rner authentication which is simple yet secure?\n Intuitive online learner and teacher management features?\n An active support community to help solve problems and generate new ideas?\n Affordability?\n\nSlide 6:\nTitle: Getting Started\nContent: Getting Started\nMoodle has a “modular” design so adding the Activities that form a course is a simple process:\n 1. Course creation privileges are assigned to the teacher.\n 2. Select from one of three course layout; Topic , Weekly or Social format.\n 3. Click “Turn editing on” within the blank course template.\n 4. Create the course!\nWith editing turned on, the course creator can now Add activities from an intuitive drop-down list of module plug-in features.\n\n", "rn editing on” within the blank course template.\n 4. Create the course!\nWith editing turned on, the course creator can now Add activities from an intuitive drop-down list of module plug-in features.\n\nSlide 7:\nTitle: Course Management Features - Modules\nContent: Course Management Features - Modules\nGlossary Create a glossary of terms used in a course. Has display format options including entry list, encyclopaedia, FAQ, dictionary style and more. \nJournal Learners reflect, record and revise ideas. \nLabel Add descriptions with images in any area of the course homepage.\nLesson Allows instructor to create and manage a set of linked \"Pages\". Each page can end with a question. The student chooses one answer from a set of answers and either goes forward, backward or stays in the same place in the lesson.\n\n", "nd manage a set of linked \"Pages\". Each page can end with a question. The student chooses one answer from a set of answers and either goes forward, backward or stays in the same place in the lesson.\n\nSlide 8:\nTitle: Course Management Features - Modules\nContent: Course Management Features - Modules\nForums\nThreaded discussion boards for asynchronous group exchange on shared subject matter. Participation in forums can be an integral part of the learning experience, helping students define and evolve their understanding of subject matter. \nStudents can Rate a forum post, based on Scales set up by the course creator\n\n", "e an integral part of the learning experience, helping students define and evolve their understanding of subject matter. \nStudents can Rate a forum post, based on Scales set up by the course creator\n\nSlide 9:\nTitle: Course Management Features - Modules\nContent: Quiz Create all the familiar forms of assessment including true-false, multiple choice, short answer, matching question, random questions, numerical questions, embedded answer questions with descriptive text and graphics.\nCourse Management Features - Modules\nInstructors have granular control in defining course assessments, and can import quiz questions from popular formats like Blackboard, IMS QTI and WebCT. Moodle also supports embedding audio into a quiz.\n\n", "ructors have granular control in defining course assessments, and can import quiz questions from popular formats like Blackboard, IMS QTI and WebCT. Moodle also supports embedding audio into a quiz.\n\nSlide 10:\nTitle: Course Management Features - Modules\nContent: Course Management Features - Modules\nResource The primary tool for bringing content into a course; may be plain text, uploaded files, links to the web, Wiki or Rich Text (Moodle has built-in text editors ) or a bibliography type reference. \nSurvey This module aids an instructor in making online classes more effective by offering a variety of surveys (COLLES, ATTLS), including critical incident sampling.\nWorkshop An activity for peer assessment of documents (Word, PP etc.) that students submit online. Participants can assess each other’s project. Teacher makes final student assessment, and can control opening and closing periods.\nMoodle supports adding math expressions to a Resource activity, using the built-in HTML editor\n\n", "h other’s project. Teacher makes final student assessment, and can control opening and closing periods.\nMoodle supports adding math expressions to a Resource activity, using the built-in HTML editor\n\nSlide 11:\nTitle: Learner Management Features – Participants\u000b\nContent: Learner Management Features – Participants \nOne click and you can view activity from all participants enrolled in the course. Learners create a personal profile that can include a picture, helping connect students socially in the online learning community.\nLearners complete a personal profile page that helps build the online learning community. Adding a picture and details to the profile creates a social connection.\n\n", "y in the online learning community.\nLearners complete a personal profile page that helps build the online learning community. Adding a picture and details to the profile creates a social connection.\n\nSlide 12:\nTitle: Learner Management Features - Grades\u000b\nContent: Learner Management Features - Grades \nThe Grades feature in Moodle provides a quick view of all Forum, Assignment, Journal, Quiz, Lesson and Workshop grades. The grading scale applied to a learner’s submission is shown, along with a cumulative total, on a single page. \nGrades can be downloaded in Excel or plain text for inclusion into an existing electronic gradebook \n\n", "ale applied to a learner’s submission is shown, along with a cumulative total, on a single page. \nGrades can be downloaded in Excel or plain text for inclusion into an existing electronic gradebook \n\nSlide 13:\nTitle: Learner Management Features - Grades\nContent: Learner Management Features - Grades\nViewing Assignment and Journal submissions, and adding Grades and comments, are done from a single page that displays all enrolled students.\nManaging student submissions are done from one central screen. This cuts down on the time it takes to assess many students work.\n\n", "nts, are done from a single page that displays all enrolled students.\nManaging student submissions are done from one central screen. This cuts down on the time it takes to assess many students work.\n\nSlide 14:\nTitle: Learner Experience - Login\nContent: Learner Experience - Login\nLearners find it easy to navigate a Moodle course homepage in their browser; intuitive “breadcrumb” links are always present. Login occurs on a familiar screen. Initial account set up may be handled by the learner or administrator.\nMoodle's has its own authentication system, but will integrate with an external database, POP3, IMAP, LDAP or NNTP, allowing domain wide login.\nNavigation bar provides breadcrumb links from course homepage to activities\n\nSlide 15:\nTitle: Manage your course\u000b\nContent: Manage your course\nSet up your course\nAdd students\nTrack progress\nUpload files\n\n", "Slide 16:\nTitle: Course homepage\u000b\nContent: Course homepage\nClassic theme\n1.Navigation block\nNormally visible on all pages, this block helps you find your way around the course and site.\n2.Administration block\nAgain, normally visible on all pages, this block gives different levels of access to teachers and students.\n3. Turn editing on A clearly visible button allows you to turn editing on and off.\n4. Course sections\nHere is where the learning materials are displayed. This element may be arranged in one or multiple weeks, topics, forums or other (non-standard) layouts.\n5. New feature in  Moodle 4.0 !Collapse all. Sections can be collapsed and expanded individually or you can use the Collapse all link to collapse them all at once.\n6.Side blocks\nSide blocks can be added when the editing is turned on.\nWhich blocks you see depend on what the administrator has selected and what you as teacher choose to add.\n\n", "apse them all at once.\n6.Side blocks\nSide blocks can be added when the editing is turned on.\nWhich blocks you see depend on what the administrator has selected and what you as teacher choose to add.\n\nSlide 17:\nTitle: To edit a course section\u000b\nContent: To edit a course section\nEnable Edit mode/turn editing on\nQuickly rename sections from the pencil icon.\n If Restrict access is enabled for the site, access to the section (including all activities and resources within it) may be restricted.\n\n", "turn editing on\nQuickly rename sections from the pencil icon.\n If Restrict access is enabled for the site, access to the section (including all activities and resources within it) may be restricted.\n\nSlide 18:\nTitle: To move a course section\u000b\nContent: To move a course section\n( Note:The ability to move course sections is controlled by the capability  moodle / course:movesections , which is allowed for the default role of teacher.)\nEnable edit mode/turn editing on.\nDrag and drop the section either from the course central area or the Course index to your chosen location.\nIf your course is long you can also drag from the central area to a location in the Course index, and/or you can click the three dots next to a section, select Move and choose the location to move it to.\n\n", "ur course is long you can also drag from the central area to a location in the Course index, and/or you can click the three dots next to a section, select Move and choose the location to move it to.\n\nSlide 19:\nTitle: To add course sections\u000b\nContent: To add course sections\nEnable edit mode/turn editing on.\nIf you are using Topics then find the location you want to add a new section and click Add topic.\nIf you are using Weeks then go to the bottom of the course page and click Add week.\n\nSlide 20:\nTitle: To delete a course section\u000b\nContent: To delete a course section\nWith the editing turned on, click the 'Edit' link to the right of the course section you wish to delete and then, from the menu that displays, click 'X Delete'. You will be prompted to confirm your wish to delete the section and its contents. Note that all activities inside the section and their user data will also be deleted. Use the Recycle bin to reverse this if you do it by mistake.\n\n", "m your wish to delete the section and its contents. Note that all activities inside the section and their user data will also be deleted. Use the Recycle bin to reverse this if you do it by mistake.\n\nSlide 21:\nTitle: To link course sections\u000b\nContent: To link course sections\nAn admin setting  Always link course sections  can be enabled from  Site administration > Appearance > Navigation  and will link course sections so that when a course section name is clicked in the navigation block or the central content area, it will go directly to that section.\n\n", "ation > Appearance > Navigation  and will link course sections so that when a course section name is clicked in the navigation block or the central content area, it will go directly to that section.\n\nSlide 22:\nTitle: Blocks\u000b\nContent: Blocks\nThe Boost and Classic themes only only displays blocks on the right, although contributed themes might display them on the left.\nTo add a block to the course page\nEnable Edit mode top right.\nExpand the block drawer and click Add block. Select your block.\nTo move a block\nWith Edit mode on, click the crosshair icon on a block.\nWhile keeping the block selected, drag it to where you want to position it and let go.\n\n", "Slide 23:\nTitle: Activities and resources\u000b\nContent: Activities and resources\nTo add an activity or resource to the course\nEnable Edit mode.\nClick 'Add an activity or resource' to open the activity chooser. Double-click to add an activity or resource; click the i for more information and click the star icon to add it to a separate, starred tab.\nAlternatively, certain resources and activities may be added using drag and drop:\nTo add a file, simply drag and drop it onto the course section where you'd like it to appear\nTo add a folder of files, simply zip the folder then drag and drop it onto the course section where you'd like it to appear, answer 'Unzip files and create folder' to the popup dialogue, then click the upload button\nTo add a SCORM package, simply drag and drop it onto the course section where you'd like it to appear, answer 'Add a SCORM package' to the popup dialogue, then click the upload button\n\n", "Slide 24:\nTitle: \u000bCourse Add students\u000b\u000b\nContent: Course Add students \nThe process of adding students to courses is called Enrolment. This is different from adding users to the site, which is known as Authentication. There are various methods of enrolling students into courses, once they have logged in to Moodle.\nA teacher can view, activate, add and remove the enrolment methods within their course from the Enrolment methods link accessed either from the gear menu in the nav drawer Participants link, or from the More link in the course gear menu (or in  Course administration > Users  in the Administration block if you are using a theme other than Boost). It may also be the case that the students are automatically enrolled into the course by an administrative process, and the teacher does not need to do anything.\n\n", " are using a theme other than Boost). It may also be the case that the students are automatically enrolled into the course by an administrative process, and the teacher does not need to do anything.\n\nSlide 25:\nTitle: Students enroll themselves\u000b\nContent: Students enroll themselves\nIf  Self enrolment is enabled then students can sign up to courses themselves. The teacher can restrict enrolment to those who have been given an Enrolment key and, if needed, a staff member may be given the  Keyholder role to manage enrolment keys.\n\nSlide 26:\nTitle: Teachers manually enrol students\u000b\nContent: Teachers manually enrol students\nIf  Manual enrolment is enabled (and it usually is) then teachers may add students to their course from the nav drawer Participants link by clicking 'Enrolled users' in the gear menu (or in  Course administration > Users  in the Administration block if you are using a theme other than Boost).\n\n", "rse from the nav drawer Participants link by clicking 'Enrolled users' in the gear menu (or in  Course administration > Users  in the Administration block if you are using a theme other than Boost).\n\nSlide 27:\nTitle: Tracking progress\u000b\nContent: Tracking progress\nGrades\nEvery course has its own Gradebook which is accessible from  Course administration > Gradebook setup.  Some activities such as Assignment and Quiz send grades back to this gradebook. It is also possible for teachers to enter grades directly into the gradebook.\n\nSlide 28:\nTitle: Competencies\u000b\nContent: Competencies\nCompetencies  describe the level of understanding or proficiency of a learner in certain subject-related skills. Competency-based education (CBE), also known as Competency-based learning or Skills-based learning, refers to systems of assessment and grading where students demonstrate these competencies.\n\n", "skills. Competency-based education (CBE), also known as Competency-based learning or Skills-based learning, refers to systems of assessment and grading where students demonstrate these competencies.\n\nSlide 29:\nTitle: Activity completion\u000b\nContent: Activity completion\nIf  Activity completion is enabled by the administrator and in the course settings, teachers can indicate for each course item how they wish it to be registered as complete. A tick/checkmark will then appear against the activity. Students may either mark it complete manually or the item will automatically be registered as complete once a student has met the specified criteria. These may be viewing a resource, submitting an assignment, posting in a forum or other conditions. The teacher can see an overview of who has completed what in the activity completion report in  Course administration > Reports > Activity completion.\n\nSlide 30:\n\n", "ting in a forum or other conditions. The teacher can see an overview of who has completed what in the activity completion report in  Course administration > Reports > Activity completion.\n\nSlide 30:\n\nSlide 31:\nTitle: Course completion\u000b\nContent: Course completion\nAs an extension of activity completion, enabling Course completion allows for a course to be officially marked as finished, either manually or automatically according to speficied criteria. If the Course completion status block is added, students can see their progress during the course. Teachers can view the overall progress of students towards course completion from  Course administration>Reports>Course completion.\n\n", "block is added, students can see their progress during the course. Teachers can view the overall progress of students towards course completion from  Course administration>Reports>Course completion.\n\nSlide 32:\nContent: Badges\nBadges  can be awarded either manually or using activity completion settings in a course and are a popular way to motivate students. Students may be awarded badges at different stages of the course for different levels of progress.\nCourse reports\nA number of Course reports are available to the teacher in their course to help them track the progress of their students. In addition to the activity and course completion reports mentioned above (which are only available if these settings are enabled) there are also activity reports, participation reports and general course logs.\n\n", "to the activity and course completion reports mentioned above (which are only available if these settings are enabled) there are also activity reports, participation reports and general course logs.\n\nSlide 33:\nTitle: Add a resource or activity\u000b\nContent: Add a resource or activity\nInstead of drag and drop, you can click the link 'Add an activity or resource' and select either File or Folder from the activity chooser.\n\nSlide 34:\nTitle: Viewing uploaded files\u000b\nContent: Viewing uploaded files\nOnce uploaded, files appear as thumbnails in the file manager for easy recognition.\nFiles view can be easily toggled between icons view or a table view with sizes and dates, or a hierarchical list view.\n\nSlide 35:\nTitle: Editing or updating uploaded files\u000b\nContent: Editing or updating uploaded files\nClicking on the name of an uploaded file opens up a pop up dialogue box which allows file details quickly to be altered.\n\n", "iting or updating uploaded files\u000b\nContent: Editing or updating uploaded files\nClicking on the name of an uploaded file opens up a pop up dialogue box which allows file details quickly to be altered.\n\nSlide 36:\nTitle: Manage your site\u000b\nContent: Manage your site\nAdd users\nAdd courses\nChange the look and feel\nInstall plugins\n\nSlide 37:\nTitle: Add users\u000b\nContent: Add users\nUsers may be added to a Moodle site in several ways. When user accounts are created on a site, the process is called Authentication, and when users join a course, the process is called Enrolment. Normally only the administrator is allowed to add users to a site. Course teachers can only add students to their course and do not have permission to add users to the site. (If you're a teacher looking for instructions on how to add students to your course, read  Add students.)\n\n", "s can only add students to their course and do not have permission to add users to the site. (If you're a teacher looking for instructions on how to add students to your course, read  Add students.)\n\nSlide 38:\nTitle: Users sign up to the site themselves\u000b\nContent: Users sign up to the site themselves\nIf you wish people to create their own accounts on your site, you must enable Email-based self-registration. This feature is disabled by default because of the possibility of spammers accessing your site.\n\n", "Slide 39:\nTitle: The admin creates accounts manually\u000b\nContent: The admin creates accounts manually\nThis process is called Manual authentication and is enabled by default on a site. You can lock certain fields, set password expiry dates, and configure other settings from  Site administration > Plugins > Authentication > Manual accounts.\nAs an administrator, you can add users one at a time from  Site administration > Users > Accounts > Add a new user . See the documentation Add a new user for more details.\nYou can also upload users in batches with a CSV file from  Site Administration > Users > Accounts > Upload users . See the documentation Upload users for more details.\n", "dd a new user for more details.\nYou can also upload users in batches with a CSV file from  Site Administration > Users > Accounts > Upload users . See the documentation Upload users for more details.\nThe CSV file will also upload users directly into courses and groups within those courses. In the example below, new students are added to the site and enrolled in specified groups in two courses, English and Mathematics. (The courses need to exist already, but if the groups do not already exist, Moodle will create them on upload.)\n\n", "Slide 40:\nTitle: Adding a course\u000b\nContent: Adding a course\nBy default a regular teacher can't add a new course. To add a new course to Moodle, you need to have either Administrator, Course Creator or Manager  rights.To add a course:\nFrom the Site administration link, click Courses>Manage courses and categories.\nClick on the category where you want your course to be. For more information see Course categories\nClick the \"New course\" link\nEnter the course settings, and then choose either to \"Save and return\" to go back to your course, or \"Save and display\" to go to the next screen.\nOn the next screen,if you have chosen \"Save and display\", choose your students/teachers to assign to the course.\n\n", "nd return\" to go back to your course, or \"Save and display\" to go to the next screen.\nOn the next screen,if you have chosen \"Save and display\", choose your students/teachers to assign to the course.\n\nSlide 41:\nTitle: Deleting a course\u000b\nContent: Deleting a course\nTeachers cannot delete courses. Managers (i.e. users with a role for which the capability  moodle / course:delete  is allowed) can delete courses and course creators can delete courses they have created themselves, but only within 24 hours of creating the course. This is so that courses created by mistake may be deleted without needing to ask an administrator.\nAdministrators can always delete courses.\nTo delete a course (as an admin or manager):\nFrom the Site administration link, click Courses > Manage courses and categories\nClick the course's category and click the course in the screen on the right.\nClick the Delete link.\n\n", "dmin or manager):\nFrom the Site administration link, click Courses > Manage courses and categories\nClick the course's category and click the course in the screen on the right.\nClick the Delete link.\n\nSlide 42:\nTitle: Sorting courses\u000b\nContent: Sorting courses\nCourses may be sorted by an admin or manager from  Administration>Site administration>Courses>Manage courses and categories.\nCourses may be sorted by ascending/descending and by time created.\n\nSlide 43:\nTitle: Teacher view:\u000b\nContent: Teacher view:\nOnce students have submitted work, click on the assignment and click “Grades”\nHere , the submission may be annotated  (1)  and/or downloaded  (2) ; a grade entered  (3)  and individual feedback given  (4).  The teacher saves the changes  (5)  and moves to the next student  (6)\n\n", "ere , the submission may be annotated  (1)  and/or downloaded  (2) ; a grade entered  (3)  and individual feedback given  (4).  The teacher saves the changes  (5)  and moves to the next student  (6)\n\nSlide 44:\nTitle: What is the Forum activity?\u000b\nContent: What is the Forum activity?\nThe Forum activity allows students and teachers to exchange ideas by posting comments as part of a 'thread'. Files such as images and media maybe included in forum posts. The teacher can choose to grade and/or rate forum posts and it is also possible to give students permission to rate each other's posts.\n\n", " Files such as images and media maybe included in forum posts. The teacher can choose to grade and/or rate forum posts and it is also possible to give students permission to rate each other's posts.\n\nSlide 45:\nTitle: How is it set up?\u000b\nContent: How is it set up?\nIn a course, with the editing turned on, choose 'Forum' from the activity chooser.\nGive it a name and, if needed, a description.\nChoose your Forum type, clicking the question mark (?) icon for descriptions of each type. If you're unsure, use the default Standard forum for general use.\nExpand the other sections to define the settings you want. For more help, see Forum settings.\nClick Save and display and, optionally, add a post to get started.\n\n", "fault Standard forum for general use.\nExpand the other sections to define the settings you want. For more help, see Forum settings.\nClick Save and display and, optionally, add a post to get started.\n\nSlide 46:\nTitle: How does it work?\u000b\nContent: How does it work?\nStudent view\nStudents access the forum by clicking the icon on the course page and depending on the forum type selecting, will typically be see a button to start a new discussion topic. They can sort discussions, subscribe to discussions from the toggle button, and favorite/bookmark discussions from the star icon on the left. This moves the discussion to the top of the list, under any discussions pinned by the teacher.\n\n", "o discussions from the toggle button, and favorite/bookmark discussions from the star icon on the left. This moves the discussion to the top of the list, under any discussions pinned by the teacher.\n\nSlide 47:\nTitle: cont….\nContent: cont ….\nWhen starting a new discussion or replying If they click into a discussion, they have a link to reply and a 'Permalink'.\nWhen replying, a basic text editor is available. Clicking the link Advanced displays the full editor and options such as uploading attachments .\nPosts can be edited for a limited time,usually 30 minutes, dependent on the administrator's settings.\n\nSlide 48:\nTitle: Teacher view\u000b\nContent: Teacher view\nTeachers additionally have three dots to the right of the Subscribe option, allowing them to pin, star or lock discussions .\nWhen replying to a forum post, teachers also optionally can send a Private reply which is only seen by that particular student. Students cannot reply to this private reply.\n\n", "tar or lock discussions .\nWhen replying to a forum post, teachers also optionally can send a Private reply which is only seen by that particular student. Students cannot reply to this private reply.\n\nSlide 49:\nTitle: What is the Quiz activity?\u000b\nContent: What is the Quiz activity?\nThe Quiz is a very powerful activity that can meet many teaching needs, from simple, multiple-choice knowledge tests to complex, self-assessment tasks with detailed feedback.\nQuestions are created and stored separately in a Question bank and can be reused in different quizzes.\nWhen creating a Quiz you can either make the questions first and add them to the Quiz, or add a Quiz activity (as below) and create the questions as you go along.\n\n", "Slide 50:\nTitle: How is it set up?\u000b\nContent: How is it set up?\nIn a course, with the editing turned on, choose Quiz  from the activity chooser.\nGive it a name and, if required, a description.\nExpand the other sections to select the settings you want. With the default settings, students can repeat the quiz, moving freely between questions, each on a different page. There is no time limit and scores and feedback display once they have completed the quiz.\nTo change any of these defaults, and for more information on configuring your quiz, see Quiz settings.\nClick Save and display.\nClick Edit quiz\nClick Add and then click '+ a new question' (If you already made questions in the question bank, then click '+ from question bank' or if you wish to add a question randomly picked from a category of questions, click '+ a random question'.)\n\n", "n' (If you already made questions in the question bank, then click '+ from question bank' or if you wish to add a question randomly picked from a category of questions, click '+ a random question'.)\n\nSlide 51:\nTitle: cont..\nContent: cont..\nChoose the type of question you want to add and then click 'Add' at the bottom:\nAdd your question. For help, see the documentation Question types.\nClick Save changes and repeat the steps for as many questions as you need.\nClick 'Save changes' when you have made your question.\nIf you want, change the maximum grade for your quiz to reflect the number of questions.\n\nSlide 52:\nTitle: How does it work?\u000b\nContent: How does it work?\nStudent view\nQuizzes are visible on the page once you add them so if you don't want them to see it as you are creating questions, hide it until you are ready.\nDepending on the settings, students may see questions all on one page or on separate pages. There will be a block linking to each question.\n\n", "s you are creating questions, hide it until you are ready.\nDepending on the settings, students may see questions all on one page or on separate pages. There will be a block linking to each question.\n\nSlide 53:\nTitle: cont…\nContent: cont …\nStudents can flag questions to alert the teacher to possible queries.\nIn order to finish the quiz and potentially see their scores (depending on the settings) students must click 'Submit all and finish' when they reach the Summary of attempt page:\n\nSlide 54:\nTitle: Teacher view\u000b\nContent: Teacher view\nTeachers should preview the quiz to ensure it displays as desired for students :\nGrades can be viewed either by clicking the quiz and the link 'Attempts' when students have attempted the quiz, or from the Actions menu top right > Results (as in the above screenshot ).\n\n", "students :\nGrades can be viewed either by clicking the quiz and the link 'Attempts' when students have attempted the quiz, or from the Actions menu top right > Results (as in the above screenshot ).\n\nSlide 55:\nTitle: Questions?\nContent: Questions?\n1) What is moodle ?\n2) W hat do you want from an online learning system?\n3 ) How to add new course using moodle ?\n4) What are the different course management features ?\n5) How to add quiz for students ?\n6) What are different learner management features ?\n7) Explain various features of homepage ?\n8) Explain how to Add, Delete, Modify courses ?\n9)What is a Forum Activity ?\n10) What are the activities of managers site ?\n\nSlide 56:\nContent: THANK YOU", "Slide 1:\nContent: PrestaShop\nBuilding an administration of PrestaShop based website\n\nSlide 2:\nContent: Overview\n\nSlide 3:\nContent: What is PrestaShop?\nFounded in Paris in 2011, PrestaShop claims it is the leading eCommerce platform in Europe and Latin America. As an Open-source content management system, it handles all the basic infrastructure yet still allows you to freely customize nearly everything for your website.\n\n", "Slide 4:\nContent: Features of PrestaShop\nEase Of Use\nPrestaShop provides users with amazing tools to simplify the daily operating procedure for you. For example, the main dashboard is quite straightforward and easy to navigate. You can easily monitor everything from your sales, orders, profits… Additionally, you can navigate to any parts of your store using the main menu on the left.\nPayment Gateway\nApart from third-party providers, PrestaShop also provides PrestaShop Checkout. This Checkout solution is built with PayPal and integrates with various checkout options, including American Express, Mastercard, and many others. With this option, you can enable direct payment for your store, which means your customer can purchase without having to go to another site.\nCustomization\n", "erican Express, Mastercard, and many others. With this option, you can enable direct payment for your store, which means your customer can purchase without having to go to another site.\nCustomization\nAs mentioned above, PrestaShop is an Open-source website builder, and the customization possibility is endless. You’re going to need two modules for your store, one that’s easy to make fast, simple edit (User module) and an advanced module for tweaking the HTML, CSS, and JavaScript files to create a unique function for your site (Develop module).\n\n", "Slide 5:\nContent: Features of PrestaShop\nFree & Open Source\nIt’s completely free to download and install PrestaShop. However, the process of setting up your store can be a little bit tricky and you might need some technical skills to get it done.\nSEO-Friendly\nSEO is the most important thing for any E-Commerce business. PrestaShop makes it very easy to develop SEO-friendly URLs. If you have basic knowledge of Search Engine Optimization, PrestaShop allows you to easily change Title tags, Meta Title, Meta Description, and other SEO-related attributes. It helps you to keep your online store up to date with your target audience.\nCost\n", "n, PrestaShop allows you to easily change Title tags, Meta Title, Meta Description, and other SEO-related attributes. It helps you to keep your online store up to date with your target audience.\nCost\nPrestaShop has zero cost for the first installation and it installs all the essential features to run your store initially. So, as a part of PrestaShop development services, if you wish to extend the functionality of your store to grow your business, then you have to purchase the add-ons as per your requirement and business strategy. PrestaShop has an add-on marketplace that holds a lot of modules according to your business strategy. Comparatively, the cost of the add-ons is lesser than or equal to other E-Commerce add-ons.\n\n", "Slide 6:\nContent: How to Install PrestaShop?\nTHERE ARE MAINLY 3 WAYS TO INSTALL PRESTASHOP\n\nSlide 7:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nThe Process\nStep 1: Download PrestaShop \n\nSlide 8:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nStep 2: Uploading the Files on Your Server \n\nSlide 9:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nStep 2: Uploading the Files on Your Server \n\nSlide 10:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nStep 3: Creating the Database\n\nSlide 11:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nStep 4: Installing PrestaShop with the Installation Assistant\n\nSlide 12:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nStep 4: Installing PrestaShop with the Installation Assistant\n\n", "Installing PrestaShop with the Installation Assistant\n\nSlide 12:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nStep 4: Installing PrestaShop with the Installation Assistant\n\nSlide 13:\nContent: How to Install PrestaShop?\nManual Installation via MySQL & FTP\nStep 4: Installing PrestaShop with the Installation Assistant\n\nSlide 14:\nContent: How to Install PrestaShop?\nOne-Click Installation with Hosting Provider \nThe Process\n\nSlide 15:\nContent: How to Install PrestaShop?\nOne-Click Installation with Hosting Provider \n\nSlide 16:\nContent: How to Install PrestaShop?\nLocalhost Installation \nThe Process\nStep 1: Download PrestaShop and put it in C://XAMPP/htdocs/studyopedia/ \n\nSlide 17:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 2: Start Apache and MySQL\n\nSlide 18:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 3: Open localhost/studyopedia in your browser and click next\n\n", "aShop?\nLocalhost Installation \nStep 2: Start Apache and MySQL\n\nSlide 18:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 3: Open localhost/studyopedia in your browser and click next\n\nSlide 19:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 4: Read the License Agreement\n\nSlide 20:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 5: Check for PrestaShop Installation\n\nSlide 21:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 6: Add the Store Information\n\nSlide 22:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 7: Configure the Database\n\nSlide 23:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 8: Test your Database Connection Now\n\nSlide 24:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 9: Install Demonstration Data & Theme \n\nSlide 25:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 10: Finish Installation and Delete the Install Folder\n\n", "\nLocalhost Installation \nStep 9: Install Demonstration Data & Theme \n\nSlide 25:\nContent: How to Install PrestaShop?\nLocalhost Installation \nStep 10: Finish Installation and Delete the Install Folder\n\nSlide 26:\nContent: How to Set Up a PrestaShop Site\nSet Up New Pages. Go to Design -> Pages\nThe Process\n2.\tClick Add New Page\n\nSlide 27:\nContent: How to Set Up a PrestaShop Site\n3.\t Customize The New Page\n4.\t Navigate to Modules -> Module Manager \n\nSlide 28:\nContent: How to Set Up a PrestaShop Site\n5.\t Configure Module & Save\n6.\t Go to Design -> Pages & Click on the Pen Icon \n\nSlide 29:\nContent: How to Set Up a PrestaShop Site\n7.\t A Form will Appear & Click Save or Save and Preview.\n\nSlide 30:\nContent: Install PrestaShop Themes\nLuckily, designing a beautiful shop in PrestaShop doesn’t require advanced design or technical skills. The platform offers lots of appealing themes to choose from.\n\nSlide 31:\nContent: Install PrestaShop Themes\nTheme Catalog\n\n", "tiful shop in PrestaShop doesn’t require advanced design or technical skills. The platform offers lots of appealing themes to choose from.\n\nSlide 31:\nContent: Install PrestaShop Themes\nTheme Catalog\n\nSlide 32:\nContent: Install PrestaShop Themes\nTheme Dashboard\n\nSlide 33:\nContent: Install Other Modules\nStep 1: Click on the \"Upload a module\" Button\n\nSlide 34:\nContent: Install Other Modules\nStep 2: Drag And Drop The ZIP Of The Module That You Wish To Add\n\nSlide 35:\nContent: Install Other Modules\nStep 3: Module Activation Successful\n\nSlide 36:\nContent: PrestaShop Admin Dashboard\nStep 1: Log Into Your PrestaShop 1.6 Dashboard\n\nSlide 37:\nContent: PrestaShop Admin Dashboard\nPrestaShop 1.6 Dashboard\n\n", " 3: Module Activation Successful\n\nSlide 36:\nContent: PrestaShop Admin Dashboard\nStep 1: Log Into Your PrestaShop 1.6 Dashboard\n\nSlide 37:\nContent: PrestaShop Admin Dashboard\nPrestaShop 1.6 Dashboard\n\nSlide 38:\nTitle: Dashboard\nContent: Dashboard\nThe top bar will look familiar to WordPress users. Here’s what it contains:\nA configurable quick access drop-down menu that lets you access important actions and parts of your shop\nA search field to search your entire shop\nThe button that says  View my shop  takes you directly to the front end of your web store\nA notification button that, when clicked, shows you the latest orders, new customers, and messages\nThe little trophy icon shows your achievements in setting up your online shop\nFinally, the last icon gives you access to editing your profile and helpful resources\n\n", "rders, new customers, and messages\nThe little trophy icon shows your achievements in setting up your online shop\nFinally, the last icon gives you access to editing your profile and helpful resources\n\nSlide 39:\nTitle: Contd..\nContent: Contd..\nOn the left side, you have access to other parts of your shop. \nThe main part of the screen contains a lot of information about the state of your shop and how to improve it. \nYou can adjust all the statistics you see by changing the time frame at the top to the current or last day, month, or year. \nYou are also able to set a custom time frame and compare it to another like in Google Analytics.\n If you enable the demo mode in the top right corner, it will populate all the statistics with dummy numbers so you can better understand what they are for.\n\n", "e it to another like in Google Analytics.\n If you enable the demo mode in the top right corner, it will populate all the statistics with dummy numbers so you can better understand what they are for.\n\nSlide 40:\nTitle: Contd..\nContent: Contd..\nMost of the elements are pretty self-explanatory. \nThey tell you whether your site is up to date, the number of visitors, shopping carts, orders, sales, top products, and other important shop information. \nUnder  Forecast , you can set goals for yourself and PrestaShop will tell you how close you are to reaching them.\nThe little gear symbol in the upper right corner allows making adjustments to how they display content. \nOnce you know about modules, you can also add more elements like this to your dashboard.\nIf any of this is unclear, the big  help  button in the top right corner describes everything on screen in detail. \nYou find that on pretty much every screen in PrestaShop, so if you get stuck, this is where you can turn to.\n\n", " the big  help  button in the top right corner describes everything on screen in detail. \nYou find that on pretty much every screen in PrestaShop, so if you get stuck, this is where you can turn to.\n\nSlide 41:\nTitle: Create a Product\u000b\nContent: Create a Product\nOf course, when running an online shop, creating and managing products is one of the most central issues. \nIn PrestaShop, you find the functionality for that under  Catalog > Products . \nWhen you click it, you get to the screen shown.\nHere, you find a list of all the products on your site.\n You can also filter, activate/deactivate, duplicate, and delete them from here.\n\n", "> Products . \nWhen you click it, you get to the screen shown.\nHere, you find a list of all the products on your site.\n You can also filter, activate/deactivate, duplicate, and delete them from here.\n\nSlide 42:\nContent: To create a new product, click the button of the same name in the upper right or hit  Ctrl+P . That gets you to the left screen.\nThe first thing you need to do here is to include a name for your product at the top. \nRight next to that, you have a drop-down menu that allows you to determine whether this is a physical product, a product pack (a combination of at least two products already existing), or a virtual product.\n\n", "Slide 43:\nTitle: 1. Basic Settings\u000b\nContent: 1. Basic Settings\nClick in the field on top where it says  Drop images here  to upload product images. When you have several, you can also choose which one will be the cover. Click on them to add a caption.\nNext, you find a text editor in which you can add a product summary (which will appear on the shop page) and a longer description that will be visible for those looking at the product itself.\nFinally, you able to add features, brands, and related products. Be aware, that you need to have created those in some of the other menus already in order to be able to choose them here.\nOn the right side there are several options for important data:\nCombinations   -  Here, you determine whether this is a simple product or one where you can choose things like size, weight, color, etc. If the latter, you can configure this under the  Combinations  tab that will appear when you enable this option.\n", " is a simple product or one where you can choose things like size, weight, color, etc. If the latter, you can configure this under the  Combinations  tab that will appear when you enable this option.\nReference   -  This is the reference code for this product, which is important for stock management.\nPrice   -  Determine the price with and without taxes as well as the tax rate. More on how to set these up later.\nCategories   -  Just like  blog posts , assigning categories to products makes them easier to filter and find. Choose from the ones you already have on your site or create new ones.\n\n", "Slide 44:\nTitle: 2.Quantities\u000b\nContent: 2.Quantities\nIn this tab, you control the stock of this product and backorders:\nQuantity available and minimum quantity per purchase\nStock location, at which point stock level is considered low and whether to inform you when it gets there\nAllow/disallow backorders, configure what buyers see when the product is in and out of stock, and when it will be available again\n\nSlide 45:\nTitle: 3. Shipping\u000b\nContent: 3. Shipping\nhere’s where you deal with everything related to shipping the product:\nProduct dimensions and weight to calculate shipping costs\nDelivery time (for both in and out-of-stock product)\nAdditional shipping fees if applicable\nAvailable carriers for this product as configured in your settings\n\n", " and weight to calculate shipping costs\nDelivery time (for both in and out-of-stock product)\nAdditional shipping fees if applicable\nAvailable carriers for this product as configured in your settings\n\nSlide 46:\nTitle: 4. Pricing\u000b\nContent: 4. Pricing\nIn this screen, you make adjustments to things that have to do with the pricing of the product:\nPrice with or without tax, applicable tax rule, and whether the product is on sale\nUnit price if mandated by your location’s laws\nCost price, meaning what you paid for it, to help PrestaShop figure out your margin and profit\nSpecific prices for different groups of customers, currencies, countries, dates, and more as well as how to weight those properties\n\nSlide 47:\nTitle: 5. SEO\u000b\nContent: 5. SEO\nPrestaShop comes with pretty solid built-in SEO features. Here, you are able to control much of what the product looks like in Google search, including SEO title, meta description, and permalink. You can also set up page redirections if necessary.\n\n", "eatures. Here, you are able to control much of what the product looks like in Google search, including SEO title, meta description, and permalink. You can also set up page redirections if necessary.\n\nSlide 48:\nTitle: 6. Options\u000b\nContent: 6. Options\nFinally, this screen allows you to add additional options and information to your product:\nProduct visibility (product catalog, search, everywhere, none of the above)\nWhether it’s available for order and if it’s limited to your webshop only\nTags to help customers find what they want more easily\nCondition (new, used, refurbished) and whether to convey this information\nAdditional info like ISBN number, barcode\nAbility to customize product, such as with a custom text or image\nFiles belonging to this article, like manual, instructions, or else\n\n", "onvey this information\nAdditional info like ISBN number, barcode\nAbility to customize product, such as with a custom text or image\nFiles belonging to this article, like manual, instructions, or else\n\nSlide 49:\nTitle: 7. Publish the Product\u000b\nContent: 7. Publish the Product\nWhen you have filled in all the information, the first thing you want to do is hit  Save  at the bottom bar of the screen.\nThis way, you are sure that what you entered won’t vanish. After that, you can preview what the product looks like with the respective button. When you do, PrestaShop will already tell you if something is not right and needs to be corrected.\n\nSlide 50:\nContent: When everything is fine and you are satisfied, send out the product to your shop by switching the  Offline  button to  Online  (the reverse is also how you unpublish products, of course). And here’s the finished result:\n\n", "ne and you are satisfied, send out the product to your shop by switching the  Offline  button to  Online  (the reverse is also how you unpublish products, of course). And here’s the finished result:\n\nSlide 51:\nTitle: Adjust Your Design\u000b1. Check Theme & Logo\u000b\nContent: Adjust Your Design 1. Check Theme & Logo\nOur first stop is  Design > Theme & Logo .\nHere, you will notice the options at the top to set a logo for the homepage, your customer emails, and invoices. You are also able to set a  favicon  (the little icon that will appear in browser tabs). It’s as easy as clicking  Browse  or  Choose files , uploading, and then saving afterward. Note the size recommendation in the upper left corner.\nBelow that, you see your current theme and find buttons to visit the theme catalog and modify page layouts. We will get to that shortly.\nFinally, at the bottom, you see themes available in the PrestaShop marketplace that you can access from here.\n\n", "Slide 52:\nTitle: 2. Install and Change Your Theme\u000b\nContent: 2. Install and Change Your Theme\nIf you want to change the theme of your PrestaShop store, you can find a few themes under  Design > Theme Catalog . However, in order to get them, you need to go to the  theme marketplace , so you might as well do that directly.\nHere, you can filter themes according to your PrestaShop version, shop category, language, and much more. Unfortunately, the official marketplace does not contain any free themes, and prices are between $60 and $300.\nHowever, there are free themes out there, for example, on  Template Monster  where you can get some for the price of a social share. The PrestaShop  forums  also have a few collections of free themes.\nOnce you have settled on a theme (and/or purchased it), back in your shop, click on  +Add new theme  at the top.\nYou then have three ways of getting your theme on your site:\nUpload it as a zip file\nImport it directly from its URL\n", "me (and/or purchased it), back in your shop, click on  +Add new theme  at the top.\nYou then have three ways of getting your theme on your site:\nUpload it as a zip file\nImport it directly from its URL\nFTP it into the  themes  folder in your PrestaShop installation and pick it from the drop-down menu\nOnce uploaded, it appears in your theme list under  Theme & Logo .\nA click on  Use this theme  (hover over the new theme and confirm) activates it. After that, when you view your shop, you can see that the content is the same, however, the design has changed.\n\n", "Slide 53:\nTitle: 3. Choose Page Layouts\u000b\nContent: 3. Choose Page Layouts\nThere is a Choose layouts  button below your theme list. When you click on it, you get to a page where you can pick the layout of each of the pages on your site via the drop-down menu. What is available depends on what your theme has to offer.\n\nSlide 54:\nTitle: 4. Work With Modules\u000b\nContent: 4. Work With Modules\nDesign > Positions .\nDesign > Positions .\n\nSlide 55:\nContent: Hooks are set locations in your theme (both in the front-end and back-end) and modules can be things like widgets, statistics, link lists, subscription forms, image sliders, social buttons, and more. \nFor example, at the displayHome hook, you find a module called  Custom text blocks .\n\nSlide 56:\nContent: this is the  Lorem ipsum  filled block on the homepage.\nThe short description of the hook also tells you its position in the theme. Consequently, if you want to make changes to this block, this is where you do it.\n\n", "rem ipsum  filled block on the homepage.\nThe short description of the hook also tells you its position in the theme. Consequently, if you want to make changes to this block, this is where you do it.\n\nSlide 57:\nContent: To get rid of modules completely, click the little arrow button, and choose  Unhook .\nAlternatively, tick the boxes on the left of several modules and click the  Unhook the selection  button that appears.\nEither way, the block will no longer be there.\n\nSlide 58:\nTitle: 5.Transplant Modules\u000b\nContent: 5.Transplant Modules\nIf you want to get it back, you have to re-attach the module to the hook. \nThis is called “transplanting” in PrestaShop and has its own page. \nYou can get there via the  Transplant a module  button at the top right of the  Positions  screen.\nThe drop-down list on top shows you the available modules on your site. Once you have picked the one you want, the  Transplant to  list becomes active and gives you all the places you can attach it to\n\n", "e drop-down list on top shows you the available modules on your site. Once you have picked the one you want, the  Transplant to  list becomes active and gives you all the places you can attach it to\n\nSlide 59:\nContent: Under  Exceptions,  you are able to define where this particular module should not appear. This isn’t really applicable in this case but makes sense for other modules. Either type out a list with commas or choose from the list below.\nSave your choices at the bottom when you are satisfied. After that, the custom text block should be back. If you want to make changes at a later time, you can always click the  Edit  button of the module in the  Positions  screen to return to this menu.\n\n", " After that, the custom text block should be back. If you want to make changes at a later time, you can always click the  Edit  button of the module in the  Positions  screen to return to this menu.\n\nSlide 60:\nTitle: 6.Modify Your Menu\u000b\nContent: 6.Modify Your Menu\nif you want to make changes not to the presence or position of modules but to their content, such as the main menu. When you scroll to the bottom of the  Positions  menu, you can see that it is attached to the displayTop hook.\n\nSlide 61:\nTitle: 7. Modify Pages\u000b\nContent: 7. Modify Pages\nDesign > Pages .\nHere, we want to change the content of the  About us  page. The first thing you will notice is the so-called page categories. \nAt the moment, we simply want to scroll down to the  About us  page and click the “pen symbol” on the right to edit it. This will bring us to the following page:\n\n", "e is the so-called page categories. \nAt the moment, we simply want to scroll down to the  About us  page and click the “pen symbol” on the right to edit it. This will bring us to the following page:\n\nSlide 62:\nContent: At the top, you can change the category under which you want this page to appear. Below that, you are able to modify the page title, specify a meta title, description, and keywords (the latter is not really necessary). Set the permalink under the  Friendly URL . The preview will show you how the page will look like in search engines.\nThen create the page content in the editor.\nSave and preview at the bottom. Then display the page on your shop by switching the  Displayed  button to  Yes .\n\nSlide 63:\nTitle: Set Up a\u000b Payment Gateway\u000b\nContent: Set Up a Payment Gateway\nOnce you have created your products and designed your shop, it’s time to set up a payment gateway.\nunder  Payment > Payment Methods .\n\n", "le: Set Up a\u000b Payment Gateway\u000b\nContent: Set Up a Payment Gateway\nOnce you have created your products and designed your shop, it’s time to set up a payment gateway.\nunder  Payment > Payment Methods .\n\nSlide 64:\nContent: At the top, you find the payment methods already available to your customers. Below are a number of modules you can install to add more to your shop. There are additional ones available in the  marketplace .\nA click on  Configure  starts the setup. Beware that many of the electronic payment options allow you to run them in test mode so you can try them out without actual payment.\n\nSlide 65:\nContent: Configure any module.\nOnce active, payment gateways are automatically available to visitors, no need to hook these modules anywhere. \nHowever, if you want to remove payment gateways you are no longer using, you need to do so in the  Module Manager .\n\n", " are automatically available to visitors, no need to hook these modules anywhere. \nHowever, if you want to remove payment gateways you are no longer using, you need to do so in the  Module Manager .\n\nSlide 66:\nTitle: QUESTIONS\nContent: QUESTIONS\nHow to install prestashop CMS?\t\t\t\t\t\t\t(5)\nWrite some of the features of prestashop.\t\t\t\t\t(5)\nWhat are the content present in prestashop’s dashboard.\t\t(5)\nExplain create a product functionality of prestashop in detail.\nExplain the following w.r.t prestashops create a product functionality: basic settings, quantities , shipping, pricing and seo\nHow to publish a product in prestashop.\nHow to modify prestashop’s menu and pages? \nWrite a note on adjusting your design in prestashop.\nHow to install and change the theme in prestashop?\nWrite a note on working with module in prestashop.\nWhat are hooks and modules in prestashop?\nGive an example of a hook.\nHow to get rid of hooks?\nWhat is transplanting?\nHow to set up a payment gateway?\n\n", "ite a note on working with module in prestashop.\nWhat are hooks and modules in prestashop?\nGive an example of a hook.\nHow to get rid of hooks?\nWhat is transplanting?\nHow to set up a payment gateway?\n\nSlide 67:\nTitle: References\nContent: References .", "Document Title: PowerPoint Presentation\nBy: Asst. Prof Myrtle Fernandes\nFr. Agnel College of Arts & Commerce,\nPilar-Goa\nUNIT 3\nBUILDING AND \nADMINISTRATING A \nWORDPRESS BLOG SITE\n\nTOPICS\n- Understanding the differences between Wordpress.com sites and \nWordpress.org sites.\n- Setting up and installing a Wordpress site.\n- Finding and adding templates to a new site\n- Customize site features\n- Overview of administrative functions\n- Adding extra functionality of Wordpress blogs\n- Promoting new blog sites.\n- Security aspects of wordpress: how to make your wordpress website \nmore secure, plugins available, Backups and restore in wordpress.\n- WooCommerce plugin to build ecommerce websites using \nWordpress.\n\nWORDPRESS.COM VERSUS WORDPRESS.ORG\n\n", " make your wordpress website \nmore secure, plugins available, Backups and restore in wordpress.\n- WooCommerce plugin to build ecommerce websites using \nWordpress.\n\nWORDPRESS.COM VERSUS WORDPRESS.ORG\n\nSETTING UP AND INSTALLING A WORDPRESS SITE\nInstallation steps:\n1. Install XAMPP\n2. Install Wordpress by downloading the latest wordpress setup zip file from\nwordpress.org. Copy the setup zip file in XAMPP installation path in folder\nXampp\\htdocs\n3. Unzip the zip file and rename it with the website that you are creating. Eg.\nGoanHomes\n4. Create a database using XAMPP->MySql.\n5. Go to your browser and open\n\nSETTING UP AND INSTALLING A WORDPRESS SITE\nChoose English(United States). Continue\n\nSETTING UP AND INSTALLING A WORDPRESS SITE\nClick on Let’s go\n\nSETTING UP AND INSTALLING A WORDPRESS SITE\nEnter the database name, user name will be root, password is blank. Tables will be \nprefixed with wp_ \nWordpress creates 12 tables as part of installation. \n\n", "ETTING UP AND INSTALLING A WORDPRESS SITE\nEnter the database name, user name will be root, password is blank. Tables will be \nprefixed with wp_ \nWordpress creates 12 tables as part of installation. \n\nSETTING UP AND INSTALLING A WORDPRESS SITE\nClick on Run the installation\n\nSETTING UP AND INSTALLING A WORDPRESS SITE\nEnter the information\n\nSETTING UP AND INSTALLING A WORDPRESS SITE\nOn successful installation, click on Log in\nOnce your installation is completed, \nthere will be two parts. One your \nwebsite \n(\nand the next is your website \ndashboard-url for Admin.\nOn successful installation, go to \nAdmin dashboard by opening the \nfollowing in the browser\ns/wp-admin, give your \nUserName/password and login\n\n", "\nand the next is your website \ndashboard-url for Admin.\nOn successful installation, go to \nAdmin dashboard by opening the \nfollowing in the browser\ns/wp-admin, give your \nUserName/password and login\n\nFINDING AND ADDING TEMPLATES TO A NEW SITE\nA\nWordPress\nTheme\nis\na\nready\nmade\nWordPress\nTemplate. Some are free and some are paid for. The\nadvantage of using a WordPress Theme is that you can\nsee exactly what you are going to get before you start\nand you also save a lot of time because you do not\nhave to go through a lengthy design process.\n\nCUSTOMIZE SITE FEATURES\n1.\nGive Your Site a Name and Tagline\nTo change your site’s name, you need to access your dashboard and jump to the Settings > \nGeneral tab.\n\nCUSTOMIZE SITE FEATURES\n2. Define the Default Settings for New Users\nNext up, you can configure the way WordPress deals with new users. To do that, return to the \nSettings > General tab. This time, scroll down until you see two settings that read Membership \nand New User Default Role.\n\n", "onfigure the way WordPress deals with new users. To do that, return to the \nSettings > General tab. This time, scroll down until you see two settings that read Membership \nand New User Default Role.\n\nCUSTOMIZE SITE FEATURES\n3. Manage Your User Account\nUsers > Your Profile section.\nBelow that, you’ll see options to change your dashboard’s color scheme\n\nCUSTOMIZE SITE FEATURES\n3. Manage Your User Account\n\nCUSTOMIZE SITE FEATURES\nunder\nthe\nSettings\n>\nWriting\ntab.\n4. Specify Your Post Defaults\nUnder the Settings > Writing tab.\n\nCUSTOMIZE SITE FEATURES\nunder\nthe\nSettings\n>\nWriting\ntab.\n5. Set Up Your Home Page and Blog Feed\nSettings > Reading tab\n\nCUSTOMIZE SITE FEATURES\nunder\nthe\nSettings\n>\nWriting\ntab.\n5. Set Up Your Home Page and Blog Feed\nSettings > Reading tab\n\n", "\n>\nWriting\ntab.\n5. Set Up Your Home Page and Blog Feed\nSettings > Reading tab\n\nCUSTOMIZE SITE FEATURES\nunder\nthe\nSettings\n>\nWriting\ntab.\n5. Set Up Your Home Page and Blog Feed\nSettings > Reading tab\n\nCUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. \nHowever, there are some related settings you should take \na look at before you start publishing content.\nTo find WordPress’ comment options, go to \nthe Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the top. Here you \ncan disable blog comments altogether, using the third \noption.\n6. Configure Your Comment Settings\nSettings > Discussion tab\nBlog comments are one of the best ways to engage with your site’s visitors. \nOnce you enable user registration, users will be able to comment.\nYou can disable blog comments altogether, using the third option.\n\n", "CUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. \nHowever, there are some related settings you should take \na look at before you start publishing content.\nTo find WordPress’ comment options, go to \nthe Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the top. Here you \ncan disable blog comments altogether, using the third \noption.\n6. Configure Your Comment Settings\nSettings > Discussion tab > Other comment settings (After scrolling down)\nHere, you can specify whether users need to be registered and logged in to comment. You can \nalso force users to enter a name and email before they can leave a message.\nFor example, you can automatically close the comments sections on older articles, enable \nnested comments, and turn on pagination for long threads.\n\n", " a name and email before they can leave a message.\nFor example, you can automatically close the comments sections on older articles, enable \nnested comments, and turn on pagination for long threads.\n\nCUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. \nHowever, there are some related settings you should take \na look at before you start publishing content.\nTo find WordPress’ comment options, go to \nthe Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the top. Here you \ncan disable blog comments altogether, using the third \noption.\n7. Define the Default Image Sizes\nSettings > Media tab, and you’ll see three sets of sizes you can tinker with. The dimensions here \nare set in pixels, so keep that in mind if you want to make any changes to the defaults.\n\n", "CUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. \nHowever, there are some related settings you should take \na look at before you start publishing content.\nTo find WordPress’ comment options, go to \nthe Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the top. Here you \ncan disable blog comments altogether, using the third \noption.\n8. Specify a Structure for Your Permalinks\nPermalinks are the URLs that WordPress generates for your content. For example, when you \npublish a new blog post, WordPress might assign it a URL such as this one:\nSettings > Permalinks screen, and check out the options within. There are six permalink structures \nyou can choose from, including a custom option.\nPost\nname\npermalink\nstructure\nis\nusually the best option, since it gives\nreaders a clear idea of what the page\n", "hin. There are six permalink structures \nyou can choose from, including a custom option.\nPost\nname\npermalink\nstructure\nis\nusually the best option, since it gives\nreaders a clear idea of what the page\nis about. If you like to keep things\norganized, you can also consider using\nthe Day and name or Month and\nname options, both of which\nadd\ndates\nto\nyour\ncontent’s\nURLs.\n\n", "CUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. \nHowever, there are some related settings you should take \na look at before you start publishing content.\nTo find WordPress’ comment options, \nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the top. Here you \ncan disable blog comments altogether, using the third \noption.\n9. Upload a Favicon\nFavicons are the little images that show up to the left of your site’s title and tagline in browser \ntabs. When you set up a new website using WordPress, it won’t have a favicon by default\n\n", "a Favicon\nFavicons are the little images that show up to the left of your site’s title and tagline in browser \ntabs. When you set up a new website using WordPress, it won’t have a favicon by default\n\nCUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. H\nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the top. Here you \ncan disable blog comments altogether, using the third \noption.\n9. Upload a Favicon\nGo the Appearance > Customize tab. On this page, you can play around with your website’s \nstyle and instantly check out how any changes you make look.\n\n", "r, using the third \noption.\n9. Upload a Favicon\nGo the Appearance > Customize tab. On this page, you can play around with your website’s \nstyle and instantly check out how any changes you make look.\n\nCUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. H\nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the to\np. Here you can disable blog comments altogether, using \nthe third option.\n9. Upload a Favicon\nTo upload a new one, click on the Site Identity tab and look for the Site Icon option. \nAll you have to do is upload the image you want to use as your favicon, and WordPress will \nshow you how it will look.\n\n", "d a new one, click on the Site Identity tab and look for the Site Icon option. \nAll you have to do is upload the image you want to use as your favicon, and WordPress will \nshow you how it will look.\n\nCUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. H\nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the to\np. Here you can disable blog comments altogether, using \nthe third option.\n9. Upload a Favicon\n\n", "Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the to\np. Here you can disable blog comments altogether, using \nthe third option.\n9. Upload a Favicon\n\nCUSTOMIZE SITE FEATURES\nBlog comments are one of the best ways to engage with \nyour site’s visitors. Once you enable user registration (which \nwe covered earlier), users will be able to comment. H\nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the to\np. Here you can disable blog comments altogether, using \nthe third option.\n10. Remove Unused Themes and Plugins\nWhen launch a new WordPress website, it will include several pre-installed plugins and themes \nyou might not want to use.\nYou can just keep those plugins and themes inactive, but removing them entirely is a better \nway to keep your site tidy. To do that, go to the Plugins tab and take a look at what’s inside.\n\n", "CUSTOMIZE SITE FEATURES\nors. Once you enable user registration (which we covered \nearlier), users will be able to comment. H\nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the to\np. Here you can disable blog comments altogether, using \nthe third option. WordPress will ask you to confirm if you \nwant to delete the plugin. If you say yes, it will be removed \nfrom your site. WordPress will ask you to confirm if you want \nto delete the plugin. If you say yes, it will be removed from \nyour site.\n10. Remove Unused Themes and Plugins\nSimply go through the list of plugins here, and decide which ones you’d like to keep and which \nshould be removed. To delete a plugin, you’ll first need to Deactivate it. Then, a \nred Delete option will show up under its name.\nWordPress will ask you to confirm if you want to delete the plugin. If you say yes, it will be \nremoved from your site.\n\n", "need to Deactivate it. Then, a \nred Delete option will show up under its name.\nWordPress will ask you to confirm if you want to delete the plugin. If you say yes, it will be \nremoved from your site.\n\nCUSTOMIZE SITE FEATURES\nors. Once you enable user registration (which we covered \nearlier), users will be able to comment. H\nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the to\np. Here you can disable blog comments altogether, using \nthe third option. WordPress will ask you to confirm if you \nwant to delete the plugin. If you say yes, it will be removed \nfrom your site. WordPress will ask you to confirm if you want \nto delete the plugin. If you say yes, it will be removed from \nyour site.\n10. Remove Unused Themes and Plugins\nTo delete unused themes, you can move over to the Themes tab. Just click on a theme you \ndon’t need, and look for the Delete option in the bottom-right corner of the resulting window.\n\n", "es and Plugins\nTo delete unused themes, you can move over to the Themes tab. Just click on a theme you \ndon’t need, and look for the Delete option in the bottom-right corner of the resulting window.\n\nCUSTOMIZE SITE FEATURES\nors. Once you enable user registration (which we covered \nearlier), users will be able to comment. H\nto the Settings > Discussion tab. You should see a section \ncalled Default article settings directly at the to\np. Here you can disable blog comments altogether, using \nthe third option. WordPress will ask you to confirm if you \nwant to delete the plugin. If you say yes, it will be removed \nfrom your site. WordPress will ask you to confirm if you want \nto delete the plugin. If you say yes, it will be removed from \nyour site.\n10. Remove Unused Themes and Plugins\n\n", "yes, it will be removed \nfrom your site. WordPress will ask you to confirm if you want \nto delete the plugin. If you say yes, it will be removed from \nyour site.\n10. Remove Unused Themes and Plugins\n\nOVERVIEW OF ADMINISTRATOR FUNCTIONS\nWP Admin is your dashboard–where you control the look, feel and functionality of your site. \nHere’s where you keep track of pictures, add posts & pages, collaborators, monitor \ncomments, change the appearance, add widgets, etc.\n1. Appearance\nHow you control the overall look and functionality of the site. Choose from a range of free \n(or purchase-able) themes, add widgets, change your header, etc.\n\n", "earance, add widgets, etc.\n1. Appearance\nHow you control the overall look and functionality of the site. Choose from a range of free \n(or purchase-able) themes, add widgets, change your header, etc.\n\nOVERVIEW OF ADMINISTRATOR FUNCTIONS\n2. Posts\nHow you add new blog posts to feed to your blog page. You can also manage a series of \ntags for individual posts and categorize your posts. This is particularly helpful if you intend to \nwrite numerous entries or if you plan to collaborate with other authors.\n3. Users\nHow you manage collaborators and their editing privileges; your own profile and avatar, \netc.\n\nADDING WORDPRESS BLOGS\nCreate a New page and name it Blog and Publish it\n\nADDING WORDPRESS BLOGS\nGo to Categories->Menu. \nAdd the Blog page to the Menu by clicking Add to Menu. Click Save Menu.\n\n", "tc.\n\nADDING WORDPRESS BLOGS\nCreate a New page and name it Blog and Publish it\n\nADDING WORDPRESS BLOGS\nGo to Categories->Menu. \nAdd the Blog page to the Menu by clicking Add to Menu. Click Save Menu.\n\nADDING WORDPRESS BLOGS\nGo to Settings->Reading. \nCheck on A static page, from the Posts page drop down select Blogs. \nClick on Save changes .Now, on click of Blog, you will see that all the posts are displayed \nunder Blogs.\n\nPROMOTING NEW BLOG SITES\n\n", "eck on A static page, from the Posts page drop down select Blogs. \nClick on Save changes .Now, on click of Blog, you will see that all the posts are displayed \nunder Blogs.\n\nPROMOTING NEW BLOG SITES\n\nPROMOTING NEW BLOG SITE\n- write a blog post that can solve the problems of these readers and give \nthem a rich reading experience.\n- stand up to the expectations of your target audience\nCreate quality, \nengaging content\n- Web design is a vital aspect that leaves a first and the last impression on \nvisitor’s mind.\n- A great user experience is something that will encourage visitors to stay \non your blog longer.\nInstall the most \nsuitable theme\n- Market your blog posts on social media platforms, including Facebook, \nGoogle+, Twitter, Instagram, StumbleUpon etc. to drive more web traffic. \n- If you want a successful blog, you need to post or share your content to \nrelevant groups.\nSocial media \nmarketing\n\n", "PROMOTING NEW BLOG SITE\n- You can optimize your content by ensuring the URLs of your blog posts \ncontain relevant keywords. \n- Try to optimize the permalink in a way that it reflects your content instantly \nto visitors.\nCustomize \npermalinks\n- Guest posting means writing and posting a blog post or an article on \nsomeone else’s website or blog.\n- This technique not only promotes your blog but also gives you external link \nfrom more authority sites, which can improve your ranking on search \nengines.\nUse guest posting\n- Rank higher on Google, Yahoo, and other search engines by optimizing \nthe titles and descriptions of your blog posts.\n- Make sure your meta descriptions and title tags contain all your relevant \nkeywords, are readable for humans and accurately describe your \ncontent in an appealing way.\nCreate searchoptimized blog posts\n\n", "e sure your meta descriptions and title tags contain all your relevant \nkeywords, are readable for humans and accurately describe your \ncontent in an appealing way.\nCreate searchoptimized blog posts\n\nPROMOTING NEW BLOG SITE\n- YouTube is an ideal social media platform where you can convey your \naudio-visual message to your potential visitors in an engaging way.\n- You need to be very creative from your side.\nMake use of YouTube \nvideos\n- You just need to create an email list and keep on adding new subscribers \nto generate quality leads.\n- The subscribers in your email lists will hopefully help you share and \npromote your content across different web platforms. \nEmail marketing\n- Add your blog post to social bookmarking sites as it can help drive extra \ntraffic to your website.\n- Choose quality bookmarking sites to submit your post as low quality sites \ncan harm you in long run.\nAdd your blog post to \nsocial bookmarking \nsites\n\n", "can help drive extra \ntraffic to your website.\n- Choose quality bookmarking sites to submit your post as low quality sites \ncan harm you in long run.\nAdd your blog post to \nsocial bookmarking \nsites\n\nPROMOTING NEW BLOG SITE\n- Make sure that you update your blog on a regular basis.\n- Creating regular content gives your readers something to come \nback for and lets Google know that you’re serious about what you’re \ndoing.\nUpdate your blog \nposts regularly\n\n- \nHow to make your WordPress website more secure\n- \nPlugins available\n- \nBackups and restore in WordPress\nSECURITY ASPECTS OF WORDPRESS\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n1.\nSecure your login procedures.\nUse strong passwords\nEnable two-factor authentication\nDon’t make any account username “admin”\nInstall a plugin like Limit Login Attempts for the job.\nAdd a captcha\nEnable auto-logout, try the Inactive Logout plugin.\n\n", "Enable two-factor authentication\nDon’t make any account username “admin”\nInstall a plugin like Limit Login Attempts for the job.\nAdd a captcha\nEnable auto-logout, try the Inactive Logout plugin.\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n2. Use secure WordPress hosting.\nWhen choosing the service that hosts your website, security should be a top priority.\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n3. Update your version of WordPress.\nOutdated versions of the WordPress software are a very common target for hackers.\nRegularly check for and install WordPress updates\nTo update WordPress to the latest version, first back up your site and check that your plugins\nare compatible with the latest version of WordPress, updating plugins accordingly.\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n4. Update to the latest version of PHP. \nUpgrading to the latest version of PHP is one of the most important steps you can take to keep\nyour WordPress website secure.\n\n", "R WORDPRESS WEBSITE MORE SECURE\n4. Update to the latest version of PHP. \nUpgrading to the latest version of PHP is one of the most important steps you can take to keep\nyour WordPress website secure.\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n5. Install one or more security plugins.\nInstall one or more reputable security plugins on your website.\nWhichever plugin(s) you decide to install, security-related or not, make sure they’re wellestablished and legitimate.\n6. Use a secure WordPress theme.\nTo prevent vulnerabilities caused by a WordPress theme, choose one that is compliant with\nWordPress standards.\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n7. Enable SSL/HTTPS.\nTo see whether your WordPress site follows the SSL protocol, visit your\nWordPress site’s homepage. If the homepage URL begins with “ (the\n“s” stands for “secure”), your connection is secured with SSL.\nIf the URL begins with “ you’ll need to obtain an SSL certificate for your\nwebsite.\n\n", "’s homepage. If the homepage URL begins with “ (the\n“s” stands for “secure”), your connection is secured with SSL.\nIf the URL begins with “ you’ll need to obtain an SSL certificate for your\nwebsite.\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n8. Install a firewall.\nA firewall sits between the network that hosts your WordPress site and all other\nnetworks, and automatically prevents unauthorized traffic from entering your\nnetwork or system from the outside. Firewalls keep out malicious activity out of\nyour site by eliminating a direct connection between your network and other\nnetworks.\n9. Back up your website.\nBeing hacked is bad. Losing all your information is even worse.\nMake sure you have your website information backed up by WordPress\nand your host in the event of an attack (or any other incident) that causes\ndata loss.\nAutomatic/scheduled backups are recommended.\n\n", "ake sure you have your website information backed up by WordPress\nand your host in the event of an attack (or any other incident) that causes\ndata loss.\nAutomatic/scheduled backups are recommended.\n\nHOW TO MAKE YOUR WORDPRESS WEBSITE MORE SECURE\n10. Conduct regular WordPress security scans.\nIt’s a good idea to run routine check-ups on your site.\nAim for at least once a month.\nThere are multiple plugins that can scan your site for you.\n\n", "RE\n10. Conduct regular WordPress security scans.\nIt’s a good idea to run routine check-ups on your site.\nAim for at least once a month.\nThere are multiple plugins that can scan your site for you.\n\nSECURITY PLUGINS\nUsing a WordPress security plugin protects your WordPress site from malware, brute\nforce attacks, and hacking attempts.\ncan lead to bugs.\n1. Sucuri\nSucuri is the industry leader in WordPress security. It is one of the best WordPress security\nplugins on the market. They offer a basic free Sucuri Security plugin which helps you\nharden WordPress security and scan your website for common threats.\nBut the real value is in the paid plans, which come with the best WordPress firewall\nprotection. A firewall helps you block brute force and malicious attacks from accessing\nWordPress.\n\n", "ommon threats.\nBut the real value is in the paid plans, which come with the best WordPress firewall\nprotection. A firewall helps you block brute force and malicious attacks from accessing\nWordPress.\n\nSECURITY PLUGINS\nUsing a WordPress security plugin protects your WordPress site from malware, brute\nforce attacks, and hacking attempts.\ncan lead to bugs.\n1. Sucuri\nSucuri website firewall filters out bad traffic even before it reaches your server. They also \nserve static content from their own CDN servers.\nApart from security, their DNS level firewall with CDN gives you a tremendous \nperformance boost and speeds up your website.\nMost importantly, they offer to clean up your WordPress site if it gets affected by \nmalware at no additional cost. You can even take a website already affected by a \nmalware, and they will clean it up for you.\n\n", "ntly, they offer to clean up your WordPress site if it gets affected by \nmalware at no additional cost. You can even take a website already affected by a \nmalware, and they will clean it up for you.\n\nSECURITY PLUGINS\nn lead to\n2. Wordfence\nWordfence is another popular WordPress security plugin. They offer a free version of \ntheir plugin which comes complete with a powerful malware scanner, exploit \ndetection, and threat assessment features.\nThe plugin will automatically scan your website for common threats, but you can also \nlaunch a full scan at any time. You will be alerted if any signs of a security breach are \ndetected with the instructions to fix them.\nWordfence also comes with a built-in WordPress firewall. However, this firewall runs on \nyour server just before loading WordPress. This makes it a little less effective than a DNS \nlevel firewall like Sucuri.\n\n", "lso comes with a built-in WordPress firewall. However, this firewall runs on \nyour server just before loading WordPress. This makes it a little less effective than a DNS \nlevel firewall like Sucuri.\n\nSECURITY PLUGINS\nan lead to\n3. iThemes Security\nWordfence is another popular WordPress security plugin. They offer a free version of \ntheir plugin which comes complete with a powerful malware scanner, exploit \ndetection, and threat assessment features.\nThe plugin will automatically scan your website for common threats, but you can also \nlaunch a full scan at any time. You will be alerted if any signs of a security breach are \ndetected with the instructions to fix them.\nWordfence also comes with a built-in WordPress firewall. However, this firewall runs on \nyour server just before loading WordPress. This makes it a little less effective than a DNS \nlevel firewall like Sucuri.\n\n", "lso comes with a built-in WordPress firewall. However, this firewall runs on \nyour server just before loading WordPress. This makes it a little less effective than a DNS \nlevel firewall like Sucuri.\n\nBACKUPS AND RESTORE IN WORDPRESS\nAll websites on the internet are vulnerable to data loss and security threats. As \na website owner, these are some common scenarios when you may lose your \ndata:\nYour website can get hacked and hackers may destroy your data.\nYour hosting provider can lose your data\nYour host reserves the right to terminate your account and delete all your \ndata.\nThe best way to protect yourself against these threats is to regularly backup \nyour WordPress site.\nWordPress does not come with a built-in backup solution. However, there are \nseveral great WordPress backup plugins which allow you to automatically \nbackup and restore your WordPress site.\n\n", "ss site.\nWordPress does not come with a built-in backup solution. However, there are \nseveral great WordPress backup plugins which allow you to automatically \nbackup and restore your WordPress site.\n\nBACKUPS AND RESTORE IN WORDPRESS\nUpdraftPlus is one of the best WordPress backup plugins. It allows you to setup \nautomatic backup schedules. It will also help you restore your WordPress site in \ncase something bad happens.\nCreating WordPress Backup with UpdraftPlus\nFirst thing you need to do is install and activate the UpdraftPlus plugin. \nUpon activation, you need to visit Settings » UpdraftPlus Backups page to \nconfigure plugin settings.\n\nBACKUPS AND RESTORE IN WORDPRESS\nNow you need to click on the settings tab.\nThis is where you will set up an automatic backup schedule and a remote \nlocation to store your backups.\n\n", "plugin settings.\n\nBACKUPS AND RESTORE IN WORDPRESS\nNow you need to click on the settings tab.\nThis is where you will set up an automatic backup schedule and a remote \nlocation to store your backups.\n\nBACKUPS AND RESTORE IN WORDPRESS\nFirst you need to choose a backup schedule for your files. Files include your \nWordPress themes, plugins, images and other uploads.\nAfter that you need to select a backup schedule for your WordPress \ndatabase. WordPress is a database driven software. All your posts and pages, \ncomments, website settings, are stored in the database.\nYour backup schedule should be based on how often you add new content \nto your website.\nFor example, If you add two blog posts each week, then you can select a \nfortnightly backup of files and weekly backup of database.\n\n", "should be based on how often you add new content \nto your website.\nFor example, If you add two blog posts each week, then you can select a \nfortnightly backup of files and weekly backup of database.\n\nBACKUPS AND RESTORE IN WORDPRESS\nNext, you need to choose where to store your backup files.\nIt is a bad idea to save your backups on the same location as your website. \nLosing your website, means you will also lose access to your backup files.\nThis is why you need to choose a remote cloud storage service to store your \nbackups.\nUpdraftPlus allows you to save your backups to several cloud storage services \nincluding Dropbox, Google Drive, Microsoft OneDrive, and many others. You \ncan also send your backups to an email address.\nSimply click on a remote service to select it, and you will see setup instructions \nbelow.\n\n", "ox, Google Drive, Microsoft OneDrive, and many others. You \ncan also send your backups to an email address.\nSimply click on a remote service to select it, and you will see setup instructions \nbelow.\n\nBACKUPS AND RESTORE IN WORDPRESS\nWe will go ahead and click on Google drive to select it and then scroll down \nto the bottom of the page and click on the save changes button.\nUpdraftPlus will save your settings. However, you still need to give UpdraftPlus\naccess to your Google account.\nScroll down to remote storage setup instructions and click on the link next to \n‘Authenticate with Google drive’ option.\nSetting up Google drive as your remote storage service for backups\nThe link will take you to the Gmail website where you will be asked to sign-in \nusing your gmail email and password.\nAfter login, you will be asked if you want to allow UpdraftPlus to access your \nGmail account.\n\n", " take you to the Gmail website where you will be asked to sign-in \nusing your gmail email and password.\nAfter login, you will be asked if you want to allow UpdraftPlus to access your \nGmail account.\n\nBACKUPS AND RESTORE IN WORDPRESS\nYou will now be taken back to your WordPress site, and you will see the\nUpdraftPlus settings page again. Scroll down to the bottom of the page and\nclick on the Save Changes button.\nYou have now set up a backup schedule and remote location to store your\nbackups.\n\n", " see the\nUpdraftPlus settings page again. Scroll down to the bottom of the page and\nclick on the Save Changes button.\nYou have now set up a backup schedule and remote location to store your\nbackups.\n\nBACKUPS AND RESTORE IN WORDPRESS\nRestoring Your WordPress Backup with UpdraftPlus\nCreating backups is easy, but the real useful part about backups is the ability\nto restore them with the same ease.\nUpdraftPlus makes it easy to restore your WordPress site from a backup.\nIf your WordPress site was hacked or you want to start fresh, then first you will\nneed to delete everything and install WordPress again.\nNext, you will need to install and activate the UpdraftPlus plugin again on your\nfresh new WordPress site.\nUpon activation, you need to visit Settings » UpdraftPlus Backups page and\nclick on Restore button.\n\n", "u will need to install and activate the UpdraftPlus plugin again on your\nfresh new WordPress site.\nUpon activation, you need to visit Settings » UpdraftPlus Backups page and\nclick on Restore button.\n\nBACKUPS AND RESTORE IN WORDPRESS\nNext, you will need to install and activate the UpdraftPlus plugin again on your\nfresh new WordPress site.\nUpon activation, you need to visit Settings » UpdraftPlus Backups page and\nclick on Restore button.\nThis will bring you to the backups page. UpdraftPlus will scan your server to see\nif it can find an existing backup in /wp-content/updraft/ folder on your\nwebsite.\nHowever, since you deleted everything from your website it will not be able to\nfind the backup files.\nIf you saved the backup files on your computer, then you can click on\n‘Upload backup files’ link to manually upload and restore them.\n\n", " from your website it will not be able to\nfind the backup files.\nIf you saved the backup files on your computer, then you can click on\n‘Upload backup files’ link to manually upload and restore them.\n\nBACKUPS AND RESTORE IN WORDPRESS\nUpload backup files manually\nYou can also connect UpdraftPlus to remote location (Dropbox, Google Drive,\netc). This way UpdraftPlus will be able to scan remote location and use your\npreviously stored backups.\nClick on the Settings tab and then choose the remote location you used\nearlier to store your backups.\nReconnect remote storage location\nFollow the instructions to authenticate your website with the remote storage\nservice.\nDon’t forget to click on the ‘Save Changes’ button at the bottom of the page\nto restore your settings.\nNow you can switch back to ‘Existing Backups’ tab and click on the ‘Rescan\nremote location’ link.\n\n", "n’t forget to click on the ‘Save Changes’ button at the bottom of the page\nto restore your settings.\nNow you can switch back to ‘Existing Backups’ tab and click on the ‘Rescan\nremote location’ link.\n\nBACKUPS AND RESTORE IN WORDPRESS\nUpdraftPlus will now fetch your backup files from the remote location and start\nrestoring your site from the backup.\nUpdraftPlus will now fetch your backup \nfiles from the remote location and start \nrestoring your site from the backup.\n\n", "BUILDING E-COMMERCE WEBSITES USING \nWOOCOMMERCE PLUGIN\nWooCommerce is the world’s most popular open-source eCommerce solution.\nThe core platform is free, flexible, and amplified by a global community. The freedom of opensource means you retain full ownership of your store’s content and data forever.\nWhether you’re launching a business, taking brick-and-mortar retail online, or developing sites for\nclients, use WooCommerce for a store that powerfully blends content and commerce.\nCreate beautiful, enticing storefronts with themes suited to your brand and industry.\nCustomize pages in minutes using modular product blocks.\nShowcase physical and digital goods, product variations, custom configurations, instant\ndownloads, and affiliate items.\nBookings, memberships, subscriptions, and dynamic pricing rules.\nRise to the top of search results by leveraging WordPress’ SEO advantage.\n\n", "m configurations, instant\ndownloads, and affiliate items.\nBookings, memberships, subscriptions, and dynamic pricing rules.\nRise to the top of search results by leveraging WordPress’ SEO advantage.\n\nBUILDING E-COMMERCE WEBSITES USING \nWOOCOMMERCE PLUGIN\nBuilding a simple shopping website using woo commerce plugin allows you to develop ecommerce website by\nadding:\n\nproduct category,\n\ntax creation,\n\nproduct-creation,\n\ndescription, tax,\n\nproduct image,\n\nshipping information,\n\ngallery,\n\nadding product to cart,\n\nview cart,\n\ndelete/add items in cart,\n\nupdate cart,\n\nadding coupon,\n\nVAT/GST can be applied,\n\npayment gateway\nStorefront theme comes with woo commerce which can be used.\n\n", "ding product to cart,\n\nview cart,\n\ndelete/add items in cart,\n\nupdate cart,\n\nadding coupon,\n\nVAT/GST can be applied,\n\npayment gateway\nStorefront theme comes with woo commerce which can be used.\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nInstallation steps:\n1.\nInstall wordpress by downloading the latest wordpress setup zip file from wordpress.org. Copy\nthe setup zip file in XAMPP installation path in folder Xampp\\htdocs\n2.\nUnzip\nthe\nzip\nfile\nand\nrename\nit\nwith\nthe\nwebsite\nthat\nyou\nare\ncreating.\nEg.\nFernsOnlineBoutique\n3.\nCreate a database using XAMPP->MySql.\n4.\nGo to your browser and open\n5.\nSet your Database name, site title, user name, password, email id and Install wordpress.\n6.\nOn successful installation, give your UserName/password and login.\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nGo to Plugin -> Add New\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nType woocommerce\nin search bar.\nFrom the list, Install \nWooCommerce by \nAutomattic\n\n", "ING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nGo to Plugin -> Add New\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nType woocommerce\nin search bar.\nFrom the list, Install \nWooCommerce by \nAutomattic\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nAfter WooCommerce\nis installed, click on \nActivate\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen1 :\nAfter WooCommerce\nis activated, enter \nyour details on the \nscreen to your left.\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 2:\nAfter WooCommerce\nis activated, enter \nyour details on the \nscreen to your left.\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 3:\nChoose the industry in \nwhich the store \noperates\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 4:\nGive details of your \nbusiness\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 5:\nAdd free features that \nyou are interested in\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 6:\nInstall Storefront \ntheme in WordPress\n\n", "LLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 5:\nAdd free features that \nyou are interested in\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 6:\nInstall Storefront \ntheme in WordPress\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 7:\nGo to Appearances>Theme. Choose \nTheme Details on \nStoreFront Theme\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 8:\nClick on \nStorefront\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 9:\nClick on Let’s \ngo\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 10:\nSince we \nadded, Add \nexample \nproducts, \nsample \nproducts \nhave been \nadded. \nPublish the \npage to \ncheck.\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 11:\nClick on Site \nIdentity\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 12:\nSelect logo, \nchoose your \nimage, crop \nor skip \ncropping\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 13:\nThe selected \nimage \nappears on \nthe website.\n\n", "GIN on \nWORDPRESS SITE\nScreen 12:\nSelect logo, \nchoose your \nimage, crop \nor skip \ncropping\n\nINSTALLING WOOCOMMERCE PLUGIN on \nWORDPRESS SITE\nScreen 13:\nThe selected \nimage \nappears on \nthe website.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 14:\nSettings \navailable under \nwoocommerce\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 15:\nSettings \navailable under \nProducts\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 16:\nWooCommerce>Home\nHere products \ncan be added, \npayments, taxes, \nsetting shipping \ncan be done\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 18:\nWooCommerce>Report\nWhen a new \norder is placed, \nit will be \nrecorded here.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 18:\nWooCommerce>Customers\nInformation \nregarding the \ncustomers is \ndisplayed.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 19:\nWooCommerce>Reports\nInformation \nregarding the \norders, \ncustomers and \nstock is \ndisplayed.\n\n", "ation \nregarding the \ncustomers is \ndisplayed.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 19:\nWooCommerce>Reports\nInformation \nregarding the \norders, \ncustomers and \nstock is \ndisplayed.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 20:\nWooCommerce>Settings\nGeneral Tab\nInformation \nregarding the \naddress, tax, \nenabling \ncoupons, \nsequence of \ncalculating \ncoupons, \ncurrency is set\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 21:\nWooCommerce>Settings\nProducts Tab\nInformation \nregarding the \nCart, weight, \nreviews, product \nratings is set\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 22:\nWooCommerce>Settings\nShipping Tab\nShipping zones \ncan be set. i.e. \nshipping within \nthe state or \noutside state. \nFree shipping, \ncharged \nshipping.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 23:\nWooCommerce>Settings\nPayment Tab\nEnabling/Disabling \npayment method\n\n", "ithin \nthe state or \noutside state. \nFree shipping, \ncharged \nshipping.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 23:\nWooCommerce>Settings\nPayment Tab\nEnabling/Disabling \npayment method\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 24:\nWooCommerce>Settings\nAccounts & Privacy \nTab\nControls the \nbehaviour of guest \ncheckout- if they are \nallowed to login to \ncheckout, account \ncreation during \ncheckout or My \naccount page.\nRemoval of personal \ninformation\nIs controlled.\nAlso the text for \nprivacy policy is set.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 26:\nWooCommerce>Settings\nEmails Tab\nEmails received from \ncustomer or seller. \nEnabling email \ntemplate, header \nimage, footer image, \nbase color is \nprovided.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 27:\nWooCommerce>Settings\nAdvanced Tab\nHere pages are set \nfor Cart, Checkout, \nMy account, Terms \nand Conditions. \nYou should check on \nsecure checkout.\n\n", "RCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 27:\nWooCommerce>Settings\nAdvanced Tab\nHere pages are set \nfor Cart, Checkout, \nMy account, Terms \nand Conditions. \nYou should check on \nsecure checkout.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 28:\nWooCommerce>Status\nSystem Status Tab\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 29:\nWooCommerce>Status\nTools Tab\nAssuming \nWooCommerce\npage is not created, \nyou cab create. \nSimilarly deleting tax \nis done here.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 30:\nWooCommerce>Status\nLogs Tab\nAssuming there are \nany errors \ngenerated, they will \nbe logged in the log \nfile\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 31:\nWooCommerce>Status\nScheduled Action \nTab\nAny activities can be \nscheduled here.\n\nWOOCOMMERCE PLUGIN Settings on WORDPRESS \nSITE\nScreen 32:\nProducts ->All \nproducts\nAdding new \nproducts, Importing \nproducts and \nexporting is done \nhere.\n\n", "QUESTION BANK\n1.\nDifferentiate between Wordpress.com and Wordpress.org\n2.\nWhat are the steps of installing WordPress site?\n3.\nWhat are\n4.\nHow do you customize site features?\n5.\nWith examples, explain some of the site features you can customize.\n6.\nList some of the administrative functions.\n7.\nHow do you create a blog in WordPress?\n8.\nHow do you promote new blog sites?\n9.\nHow can you improve security of your WordPress website?\n10. Write a note on any three security plugins available in WordPress.\n11. Why do you need to Backup your WordPress sites?\n12. Name a plugin which can be used to create Backup and restore in WordPress.\n13. What are the steps of Backup and restore in WordPress?\n14. Name a plugin which can be used to build shopping website with features like adding products, \nadding to card, adding tax and payment options.\n15. What are the steps of creating e-commerce websites using WooCommerce plugin?\n16. Name a free theme which can be used to build a website using WooCommerce.\n", "to card, adding tax and payment options.\n15. What are the steps of creating e-commerce websites using WooCommerce plugin?\n16. Name a free theme which can be used to build a website using WooCommerce.\n17. List some of the features which you can include if you develop a website using WooCommerce\nplugin.\n\n", "REFERENCES\n7Vkk.png?auto=webp&s=52e8d99be74e10b26e36a6af7ce68536f77620ea\ntheme/#:~:text=The%20easiest%20way%20to%20customize,%2C%20click%20on%20Appearance%20%3\nE%20Customize.\nbeginners/\nbeginners/\nupdraftplus/#:~:text=First%20you%20need%20to%20visit,Backup%20Now'%20button%20to%20continue.", "Presentation Title: Unit 11 Comparison of Various CMS Tools  Comparative analysis of features of CMS Tools\n\nSlide 1:\nTitle: Unit 11\u000bComparison of Various CMS Tools \u000b Comparative analysis of features of CMS Tools \u000b\t\u000b\nContent: Unit 11 Comparison of Various CMS Tools  Comparative analysis of features of CMS Tools \t\n\n", "Slide 2:\nTitle: WordPress versus Joomla\nContent: WordPress versus Joomla\nImage Source:\nWordPress is used to create a blog, website, and mobile applications\nWordPress is developed by its founders, American developer  Matt Mullenweg  and English developer  Mike Little , on  27 May 2003 .\nWordPress does not support various languages, \nWordPress is user-friendly for beginners with a small learning curve.\nIt is written in the PHP language and connected with MySQL and MariaDB database.\nJoomla is used to publish the web component and develop dynamic websites and online applications.\nJoomla was developed by  Open Source Matters Inc . and the  Joomla community in 2005 .\nJoomla supports multiple languages and provides the capability to manage these languages.\nIt is more complex than WordPress , and it takes time to learn.\nIt is written in PHP language and uses OOP techniques and software design patterns. It supports various databases such as MS SQL, PostgreSQL , MySQL , etc.\n\n", "an WordPress , and it takes time to learn.\nIt is written in PHP language and uses OOP techniques and software design patterns. It supports various databases such as MS SQL, PostgreSQL , MySQL , etc.\n\nSlide 3:\nTitle: WordPress (WooCommerce) versus Prestashop\nContent: WordPress (WooCommerce) versus Prestashop\nImage Source:\n\nSlide 4:\nTitle: WordPress versus Wix\nContent: WordPress versus Wix\nImage Source:\n\n", "Slide 5:\nTitle: WordPress versus Moodle\nContent: WordPress versus Moodle\nMoodle\nMoodle is an open source learning management system with hundreds of millions of users around the globe and translated into over 100 languages \nused by organizations to support their education and training needs.\nMoodle when compared to WordPress is heavy in terms of  server  requirements as all additional plug-ins that comes with Moodle are all related to e-learning in one way or other.\t\nWordpress Wordpress is an open-source publishing platform \npopular with bloggers, and a content management system, known for its simplicity and modifiability. Websites may host their own blogging communities, controlling and moderating content from a single dashboard.\nWordPress PHP and server requirements are the minimum environmental settings to produce a well-working website.\nImage Source:", "Document Title: PowerPoint Presentation\nJoomla plugin\nMS. STEFFY FERNANDES\nGVM’S GGPR College of Commerce and Economics\nPONDA-GOA\n\nWhat is a plugin?\n- A plugin is a kind of Joomla! extension. \n- Plugins provide functions which are associated with trigger events.\n- \nJoomla provides a set of core plugin events, but any extension can fire (custom) events. \n- When a particular event occurs, all plugin functions of the type associated with the event are \nexecuted in sequence. \n- This is a powerful way of extending the functionality of Joomla. \n- It also offers extension developers a way to allow other extensions to respond to their \nactions, making extensions extensible.\n\n", "\n- This is a powerful way of extending the functionality of Joomla. \n- It also offers extension developers a way to allow other extensions to respond to their \nactions, making extensions extensible.\n\nCont….\n- The Joomla! plugin architecture follows the Observer design pattern. The \nJPlugin class provides the means to register custom plugin code with core or \ncustom events. \n- The JEventDispatcher class is an event handler which calls all plugins \nregistered for a particular event, when that event is triggered. \n- In Joomla 4.x this has been moved to the \\Joomla\\Event\\Dispatcher class \nin Joomla, and additionally follows the Mediator design pattern.\n\n", "red for a particular event, when that event is triggered. \n- In Joomla 4.x this has been moved to the \\Joomla\\Event\\Dispatcher class \nin Joomla, and additionally follows the Mediator design pattern.\n\nEssential Joomla Extensions to run your \nJoomla Site smoothly\n- Joomla is considered to be the most powerful CMS and the best friend for every web developer across the globe. \n- It is a free open source content management system which is used for everything from simple websites to complex one. \n- It is very popular as it is easy to install, reliable, flexible as well as user friendly.\n- Today let’s look at some of the essentials Joomla extensions to make your website user as well as admin friendly. \n\n", "ry popular as it is easy to install, reliable, flexible as well as user friendly.\n- Today let’s look at some of the essentials Joomla extensions to make your website user as well as admin friendly. \n\nJoomla Extensions\n- Extensions are add-ons that expand the functionality of Joomla!. Extensions \nare used to add capabilities to Joomla! that do not exist in the standard \npackage. Hundreds of Extensions are available for Joomla!, with more being \ndeveloped all of the time.\n- Self-contained archived file (zip) that a non-programmer can install by simply \nusing the Joomla menu driven install options\n- Components (additional functionality to site)\n- Modules (mostly provide interface to components e.g menus, lists, forms)\n- Bots (search capability, content editing, additional css formatting, embedding code)\n- Plug-ins (additional functionality to core)\n\nAdmin Menu -> Extensions -> Extension \nManager\nSelect the Install menu item in the Extension manager\nscreen that appears.\n\n", "Extensions for Libraries\n- \nLibrary Manager of Joomla!\nJoomla! Library Manager (JLibMan) provides the ability to install and uninstall custom third party libraries \ninto Joomla! 1.5 with uninstall provided by the component and installation through the Joomla! 1.5 universal \ninstaller (like the Core supported extensions, components, etc).\nURL:\n- \nAlexandria Book Library:\nAlexandria Book Library is a Joomla component that make you the ability to manage your personal book \nlibrary or a public library.Alexandria Book Library is free and open source.\nURL :\n- \nProfessional Library Management component (PLMC) : \nPLMC is designed you to manage your books and articles with cool features.PLMC provides a full-featured \nbook library (or collection) management environment on a Joomla website.\nURL Address:\n\n", "LMC) : \nPLMC is designed you to manage your books and articles with cool features.PLMC provides a full-featured \nbook library (or collection) management environment on a Joomla website.\nURL Address:\n\nExtensions for Libraries\n- \nBookLibrary Basic :\nBookLibrary provides a full-featured book library or book collection management \nenvironment on a Joomla-based website. It allows you to manage large book libraries. The \ncomponent can also be used to easily set up a book selling shop using Amazon if you want. \nWith an Amazon Associates ID (as an Amazon affiliate) you can earn credits with book sales \nthrough Amazon, while Amazon takes care of the handling and shipping.\nURL:\nculture/books-a-libraries/3728\nMany more………..\n\n", " Associates ID (as an Amazon affiliate) you can earn credits with book sales \nthrough Amazon, while Amazon takes care of the handling and shipping.\nURL:\nculture/books-a-libraries/3728\nMany more………..\n\nGoogle analytics plugin\n- Normally we would embed the Google Analytics tracking code in to the \ntemplate of each of the sites that we are build. In some circumstances we'd \nfind that the end user would want more control over the Google Analytics \ncode and would prefer to switch it on and off or insert new tracking code at \ntheir own will. So we've compiled this little plugin that allows for just that.\n- This new updated version of the plugin allows for the implementation of \nGoogle Analytics in all three methods that have been known over the years \nfrom, asynchronous, universal and the new gtag methods. It is advised that \nyou use the latest gtag method.\n\n", "lementation of \nGoogle Analytics in all three methods that have been known over the years \nfrom, asynchronous, universal and the new gtag methods. It is advised that \nyou use the latest gtag method.\n\n- It does not track the administrator area of your site and embeds the \nrequired Javascript the way that Google recommends, just before the closing \ntag. Simple install the plug-in, add in the tracking code in to the parameters \nand enable the plug-in.\n\nSteps to asynchronous google analytics plugin \njoomla\n- Asynchronous Google Analytics\n- It comes with both a free and paid version. However, for adding GA code, you only \nneed the free version. Please follow these steps to use this plugin.\n- Step 1: Download the plugin, and install it in your Joomla site.\n- Step 2: Go to Extensions/ Plugins, search for: System - Google Analytic.\n- Step 3: In the Options tab, fill in your GA tracking ID.\n- Note: you can find the tracking ID when getting GA tracking code.\n- Step 4: Enable the Plugin.\n\n", "ins, search for: System - Google Analytic.\n- Step 3: In the Options tab, fill in your GA tracking ID.\n- Note: you can find the tracking ID when getting GA tracking code.\n- Step 4: Enable the Plugin.\n\nVerify your tracking code set up\n- To see if it works or not, you can check in the active user visitor in your \ncontrol panel. In the meantime, also open your website in another browser \ntab. If you see your real-time visitors increasing, then it works.\n\n", "r not, you can check in the active user visitor in your \ncontrol panel. In the meantime, also open your website in another browser \ntab. If you see your real-time visitors increasing, then it works.\n\nAdministration of a Plugin in Joomla\n- A plugin is one of the five core \nJoomla! extension (Components, Modules, Plugins, Template and Languages) \nand is used to add extra functionality which might not be inbuilt in your \ntemplate, thus a plugin adds more features into a component or module. For \nexample it might add an extra form into a component (like the Profile \nPlugin), add shortcuts in for URLs or other code (like a BBCode Parser) or \neven give more advanced functionality like provide an extra authentication \nmethod (like the ability to login with Facebook Login).\n\nInstalling a Plugin\n- A plugin is installed like other extensions (templates, components and \nmodules) are installed. To find out how to install extensions.\n\n", "e ability to login with Facebook Login).\n\nInstalling a Plugin\n- A plugin is installed like other extensions (templates, components and \nmodules) are installed. To find out how to install extensions.\n\nJoomla Plugin Manager\n- Following are the simple steps to set or edit existing Joomla Plugins −\n- Step 1 − Click on Extension →Plugin Manager in Joomla administrator \nas shown below.\n\nCont..\n- Step 2 − After clicking on the Plugin Manager, an existing Joomla plugins \nwill be displayed as shown below.\n\nToolbar\n- Following are the toolbar options in the Plugin −\n- Edit − Edit the plug-in.\n- Enable − Enable the plug-in to use on the website.\n- Disable − Disable the plug-in which are not necessary on the website.\n- Check In − Used to check in the plug-in and after completing the process \ndisplays the successful message.\n\n", "e on the website.\n- Disable − Disable the plug-in which are not necessary on the website.\n- Check In − Used to check in the plug-in and after completing the process \ndisplays the successful message.\n\nInstalling an extension\n- The procedure will be:\n1.\nDownload the extension to your local machine as a zip file package.\n2.\nFrom the backend of your Joomla site (administration) select \nExtensions →Install/Uninstall.\n3.\nClick the Browse button and select the extension package on your local machine.\n4.\nClick the Upload File & Install button.\n5.\nSome extensions may provide further instructions on installation.\n6.\nNote that modules and plugins must be enabled before they will work.\n\n", "local machine.\n4.\nClick the Upload File & Install button.\n5.\nSome extensions may provide further instructions on installation.\n6.\nNote that modules and plugins must be enabled before they will work.\n\nManual Installation\n- First, unzip all of the files in a local directory (for instance com_installer ).\n- Then transfer the directory (using FTP) to a folder under the install directory \n(for instance administrator/components).\n- appropriate for the type of extension you are installing (visible in its xml file, \na line like <extension type=\"component“ .\n- Then use the installer, but select \"install from directory\" indicating the \ncorrect folder name. \n- This folder name should be an absolute path from the root of the filesystem.\n\n", " type=\"component“ .\n- Then use the installer, but select \"install from directory\" indicating the \ncorrect folder name. \n- This folder name should be an absolute path from the root of the filesystem.\n\nEditing a Plugins Parameters\n- Many plugins have parameters that allows you to customise their \nfunctionality without having to edit any code. We'll investigate some of these \nfeatures. Navigate to the plugin manager by going to \"Extensions\" in the \nmenu in the backend of Joomla. Then click on \"Plugin Manager\". You will \nnow see a list of all plugins available on your site. To see the full information \non what you can do on this screen click on the \"Help\" button.\n\n", " of Joomla. Then click on \"Plugin Manager\". You will \nnow see a list of all plugins available on your site. To see the full information \non what you can do on this screen click on the \"Help\" button.\n\nE XAMPLE : The Page Navigation \nPlugin\n- In this case we will visit the \"Content - Page Navigation\" plugin. This particular \nplugin will allow you to add a Table of Contents (TOC) format to articles created in \nthe content component if desired. By clicking on basic options you can see there are \ntwo parameters for this plugin. One chooses whether the 'contents' table is \ndisplayed above or below the main body of text, whilst the second lets you choose \nwhether the position is above the title and other information for the article (Full \nDisplay) just above the start of the main body of text (Text).\n- Here all we have is two simple dropdown selections. Which we can select and then \npress \"Save\" in the toolbar to save the configuration\n\n", "JOOMLA VS WORDPRESS\nJOOMLA\n- \nJoomla CMS is an excellent content \nmanagement system allowing easy management \nand maintenance of your website, with little or \nno programming knowledge needed.\n- \nAdding or removing post dates, need not to be \nchanged in design mode because menus are \ncontrolled via the control panel and attributes \nlike dates, author name etc, can be turned on \nand off per article or for the whole site in one \ngo.\n- \nJoomla will handle membership functionality.\nIf we want members to access your videos on a \nsubscription basis and have members in various \nlevels of permission (depending on their \nsubscription level), Joomla is your best bet.\nWORDPRESS\n- \nThe WordPress content management system \nis an ideal platform for bloggers as it is easy \nto install and use.\n- \nAdding or removing post dates, need to be \nchanged in design mode and it requires \nknowledge of WP scripting.\n- \nYou can add membership functionality in \nWordPress.\n\n", "t is easy \nto install and use.\n- \nAdding or removing post dates, need to be \nchanged in design mode and it requires \nknowledge of WP scripting.\n- \nYou can add membership functionality in \nWordPress.\n\nREFRENCES\n- \n- \njoomla.html#:~:text=Asynchronous%20Google%20Analytics&text=Step%\n201%3A%20Download%20the%20plugin,when%20getting%20GA%20trac\nking%20code.\n- \n- \n\nQuestion Bank\nQ1) What is Joomla plugin ? \nQ2) Explain google analytics plugin ?\nQ3) Distinguish between Joomla and WordPress ?\nQ4) What are Steps of asynchronous google analytics plugin Joomla ?\nQ5) What are extension libraries in Joomla ?\nQ6) Write steps of installation on Joomla extension ?\nQ7) Explain some examples of Joomla plugin ?\n\nTHANK YOU", "Presentation Title: PowerPoint Presentation\n\nSlide 1:\nTitle: Unit 4: Building an Online Social Network Using SocialGo \nContent: Unit 4: Building an Online Social Network Using SocialGo \nMs. Leena Divkar\nAsst. Prof. BCA\nS.V.’s Sridora Caculo College of Commerce & Management Studies\nMapusa Goa\n\nSlide 2:\nTitle: What is socialgo??\nContent: What is socialgo ??\nSocialGO is a UK-based provider of online community and social networking software.\nIt’s a Cloud-based networking solution which helps firms with advertising, event management, social media integration and group management.\nIt allows both existing communities and aspiring social network creators to create a flexible, customizable social networking website.\nIt is a Social networking platform that helps businesses of all sizes with social media marketing, customizable layouts, web advertising, chat user interface, comments moderation and more.\n\n", "Slide 3:\nTitle: What is socialgo?? Contd…\nContent: What is socialgo ?? Contd …\nSocialGO offers two products:\nSocialGO for communities, focusing on providing existing communities with a flexible tool to create an integrated web presence ( With powerful website building tools and a core host of community features (membership, private messaging, events), it is the best choice for existing communities who need a beautiful, scalable online home.\nSocialGO Network Maker, focusing on providing software to allow anyone to create a social network. With classic social networking features (friending, poking, customizable profiles), this is the best choice for aspiring social network creators.\nBoth products are browser-based and hosted in dedicated servers. This means that as long as you've got a browser and an internet connection, you can get started straight away - without having to download or install any software.\n\n", "d and hosted in dedicated servers. This means that as long as you've got a browser and an internet connection, you can get started straight away - without having to download or install any software.\n\nSlide 4:\nTitle: SocialGO Alternatives\u000b\nContent: SocialGO Alternatives\nThere are many alternatives to SocialGO , not only websites but also apps for a variety of platforms, including Self-Hosted solutions, Android, iPhone and Linux. \nDisciple : Create a passion- fuelled community with a private, owned community social network on Web, iOS and Android \nMighty Networks : Create your own social network with an activity feed, member profiles, sub-groups and more.  \nTribe : Tribe offers a fully customizable community platform to create highly engaging social networks. Users can ask questions, post answers, react, discuss, upload videos, and share interactive posts.\n\n", "Slide 5:\nTitle: SocialGO Alternatives(Contd…)\nContent: SocialGO Alternatives( Contd …)\nHumHub : HumHub is a free social network software and framework which is lightweight, powerful and comes with an user-friendly interface. With HumHub you can create your own customized social network, social intranet or huge social enterprise application that really fits your needs..\nBuddyPress : Social networking in a box. Build a social network for your company, school, sports team or any community all based on the power and flexibility of WordPress. Install BuddyPress directly through your WordPress dashboard plugins page, or download it manually from the WordPress.org plugins repository.\nOpen Source Social Network ( OSSN ) : opensource- socialnetwork also know as OSSN is a social networking software written in PHP. It allows you to make a social networking website, helps your members build social relationships with people who share similar professional or personal interests.", "Document Title: UNIT 7: Creating and Maintaining a Wikimedia site\nUNIT 7: Creating and \nMaintaining a Wikimedia \nsite\n\nIntroduction\nWikimedia is a global movement whose\nmission\nis\nto\nbring\nfree\neducational\ncontent to the world.\nThrough various projects, chapters, and\nthe support structure of the non-profit\nWikimedia Foundation, Wikimedia strives\nto bring about a world in which every\nsingle human being can freely share in the\nsum of all knowledge.\n\nInstalling Media Wiki\nStep 1: Install Xampp Server :\ng/download.html\nStep 2: go to / wiki \n/MediaWiki\nStep 3: Click on Download & \ninstall Mediawiki\n\nStep 4: Click on download \nMediawiki\n\nStep 5: Extract the downloaded files & copy the folder \nin C:\\xampp\\htdocs\nStep 6: Rename the folder as mediawiki\nStep 7: Open the browser & type localhost/mediawiki\nStep 8: click on set up the wiki\n\nStep 9: Click on continue\n\nYou should get this message\nStep 10: click on continue\n\n", "ename the folder as mediawiki\nStep 7: Open the browser & type localhost/mediawiki\nStep 8: click on set up the wiki\n\nStep 9: Click on continue\n\nYou should get this message\nStep 10: click on continue\n\nStep 11: go to xamppphpMyAdmin & \ncreate a database as my_wiki\nStep 12: go back to the installation process\nDatabase typemysql\nDatabase hostlocalhost\nDatabase namemy_wiki\nDatabase Usernameroot\nClick on continue\n\nStep 12: click on continue\nStep 13: Give any name for the wiki, set username, \npassword, specify email address\n\nStep 14: Please select below option & \nclick on continue\nStep 15: click on continue\n\nStep 16: click on continue\nStep 17: click on \n\nStep 18: save the downloaded file in \nC:\\xampp\\htdocs\\mediawiki\nStep 19: click on enter your wiki\nThis is the main portal\n\nCreating Separate Pages\nStep 1: Whichever page you want to create just type a name of that page in \nthe address bar of the browser & press enter. E.g. india\n\nStep 2: Click on create\n\n", "the main portal\n\nCreating Separate Pages\nStep 1: Whichever page you want to create just type a name of that page in \nthe address bar of the browser & press enter. E.g. india\n\nStep 2: Click on create\n\nFrom the main page also different \npages can be opened: On main \npage click on edit\nDelete the previous content & in square \nbrackets type the name of the page you \nwant to open & then click on save changes\n\nAdding Hyperlinks\nThere are 5 different types of links\nPages in same wiki [[name of the page]]\nOther websites[url of the website text to be displayed]\nEmail : [mailto:lkhorjuenkar@gmail.com]\nInterwiki: [[wikipedia:ITA software]]\nStandard HTML anchor tags GOOGLE\n\nLinking Pages in same wiki\nIn double square bracket type the link of the web page to be opened.\n\nLinking pages of other websites\nIn square bracket type the link of the web page to be opened. After the \nlink you can mention the label that you wish to display\n\n", " link of the web page to be opened.\n\nLinking pages of other websites\nIn square bracket type the link of the web page to be opened. After the \nlink you can mention the label that you wish to display\n\nCreate a wiki with sections & Table of \nContent\n\nHeadings are used to create table of content for wiki pages\n\nTable of content automatically appears on pages that uses more than 4 or more \nheadings\n\nClicking an item in the table of content will take you to that section of the wiki page\n\nIf you use headings on your wiki page, you can edit the wiki page by the section\nTo create headings:\n\nFor level 1 heading, it is \n\nFor level 2 heading, it is \n \n& so on till level 6\n\nCreate a wiki with sections & Table of \nContent(contd..)\n\nCreate a wiki with sections & Table of \nContent(contd..)\nFor each heading, we can click on edit & type content & click on save changes\n\n", "l 6\n\nCreate a wiki with sections & Table of \nContent(contd..)\n\nCreate a wiki with sections & Table of \nContent(contd..)\nFor each heading, we can click on edit & type content & click on save changes\n\nCreate a wiki with sections & Table of \nContent(contd..)\nTo disable Table of content to be displayed on the page, type the following code \nanywhere on the page __NOTOC__ (double underscore in caps lock TOC double \nunderscore)\nTable of Content does not appear on the page if less than 4 headings are used. You \ncan force the Table of Content to appear on wiki page by typing following code \nanywhere on the page __FORCETOC__\nTo disable the section edit links that allow you to edit one part of the page at a time \ntype following code anywhere on the page __NOEDITSECTION__\n\n", "following code \nanywhere on the page __FORCETOC__\nTo disable the section edit links that allow you to edit one part of the page at a time \ntype following code anywhere on the page __NOEDITSECTION__\n\nQuestion Bank\nWhat is mediawiki?\nList out the steps for installing mediawiki.\nHow to create a new page in mediawiki?\nWhich are different types of hyperlinks which can be added on mediawiki page? \nWith an example explain each one of them\nWith an example explain how different levels of haedings are created in mediawiki.\nName the commands to do the following task w.r.t table of content:\nTo disable Table of content to be displayed on the page\nTo force the Table of Content to appear on wiki page if less than 4 headings are used\nTo disable the section edit links that allow you to edit one part of the page at a time\n\n", " displayed on the page\nTo force the Table of Content to appear on wiki page if less than 4 headings are used\nTo disable the section edit links that allow you to edit one part of the page at a time\n\nReferences \nInstallation Video: Setup and Install a Wiki on Windows From Scratch – YouTube\nThe basics of MediaWiki Creating, Editing, Discussing Pages Working with the syntax \ntext formatting – YouTube\n\nYB-nCS4l&index=2\n\nnCS4l&index=6", "By: Asst. Prof Myrtle Fernandes\nFr. Agnel College of Arts & Commerce\nPilar-Goa\nUNIT 1\nINTRODUCTION TO \nCONTENT MANAGEMENT \nSYSTEMS\n\nTOPICS\n- Traditional Content Delivery Systems\n- Need for Content Organization\n- Merits /Demerits of CMS\n\nCONTENT DISTRIBUTION NETWORK (CDN) OR \nCONTENT DELIVERY NETWORK (CDN)\nsa=i&url=https%3A%2F%2Fcyb\nerhoot.com%2Fcybrary%2Fco\nntent-delivery-networkcdn%2F&psig=AOvVaw3rjM7\no3xL8ycgNb4bzoTNj&ust=164\n2312780296000&source=imag\nes&cd=vfe&ved=2ahUKEwj7o\nKeAirP1AhWYUWwGHbMIDqs\nQjRx6BAgAEAk\nImage Source\n\nCONTENT DISTRIBUTION NETWORK (CDN) OR \nCONTENT DELIVERY NETWORK (CDN)\nA\ncontent\ndelivery\nnetwork\n(CDN)\nrefers\nto\na\ngeographically distributed group of servers which work\ntogether to provide fast delivery of Internet content. A\nCDN allows for the quick transfer of assets needed for\nloading\nInternet\ncontent\nincluding\nHTML\npages,\njavascript files, stylesheets, images, and videos.\n\n", " provide fast delivery of Internet content. A\nCDN allows for the quick transfer of assets needed for\nloading\nInternet\ncontent\nincluding\nHTML\npages,\njavascript files, stylesheets, images, and videos.\n\nCONTENT DISTRIBUTION NETWORK (CDN) OR \nCONTENT DELIVERY NETWORK (CDN)\nA content delivery network, or content distribution \nnetwork (CDN), is a geographically distributed network \nof proxy servers and their data centres. The goal is to \nprovide high availability and performance by \ndistributing the service spatially relative to end users. \n\nCONTENT DISTRIBUTION NETWORK (CDN) OR \nCONTENT DELIVERY NETWORK (CDN)\nCDNs means for alleviating the performance bottlenecks of the Internet\nCDNs have grown to serve a large portion of the Internet content\nCDNs are a layer in the internet ecosystem. \nCDN is an umbrella term spanning different types of content delivery services\n\n", "e Internet\nCDNs have grown to serve a large portion of the Internet content\nCDNs are a layer in the internet ecosystem. \nCDN is an umbrella term spanning different types of content delivery services\n\nCONTENT DISTRIBUTION NETWORK (CDN) OR \nCONTENT DELIVERY NETWORK (CDN)\nCDN vendors may cross over into other industries like security, with DDoS \nprotection and web application firewalls (WAF), and WAN optimization.\nA content distribution network (CDN) is a network of servers that cache \ncontent from the main server\nCDN’s can be used for a variety of reasons, but primarily for faster delivery, \nbetter reliability and higher levels of security. \n\nCONTENT DISTRIBUTION NETWORK (CDN) OR \nCONTENT DELIVERY NETWORK (CDN)\nBy having a CDN, users lower the impact of malicious \nattacks such as DDoS attack.\n\nCONTENT MANAGEMENT SYSTEM \n(CMS)\n-is-cms/\nImage Source\n\n", "STRIBUTION NETWORK (CDN) OR \nCONTENT DELIVERY NETWORK (CDN)\nBy having a CDN, users lower the impact of malicious \nattacks such as DDoS attack.\n\nCONTENT MANAGEMENT SYSTEM \n(CMS)\n-is-cms/\nImage Source\n\nCONTENT MANAGEMENT SYSTEM \n(CMS)\n- \nWhat is Content Management System (CMS)?\n- \nThe Content Management System (CMS) is a software which stores all the\ndata such as text, photos, music, documents, etc. and is made available on\nyour website. It helps in editing, publishing and modifying the content of the\nwebsite. i.e. A content management system (CMS) is a piece of software that\nallows users to upload and manage content online.\n- \nSites such as WordPress, Jhoomla, Drupal and Wix are some examples of\nCMS's.\n- \nWordPress was initially released on 27th May, 2003 by Matt Mullenweg and\nMike Little. WordPress was announced as open source in October 2009.\n\n", ", Jhoomla, Drupal and Wix are some examples of\nCMS's.\n- \nWordPress was initially released on 27th May, 2003 by Matt Mullenweg and\nMike Little. WordPress was announced as open source in October 2009.\n\nWHY CMS SOLUTIONS?\n1. No coding knowledge required.\n2. CMS solutions allow for easy collaboration\n3. Users don't need to worry about updates\n4. Scalability\n\nCDN versus CMS\nCMS solutions rely on CDNs. \nTo simplify it; a CDN is a network of servers that cache \ndata/content, improving load speeds and security. On the other \nhand, CMS’s are pieces of software that allow users to manage \nand use their content as needed. \nA CMS may rely on a CDN to allow its users to access content and \ndata quickly but not vice versa.\nFew Examples of CDN Providers:RACKSPACE, AMAZON CLOUDFRONT, MICROSOFT AZURE CDN\nGOOGLE CLOUD CDN, MAX CDN, CLOUDFLARE\n\n", "a CDN to allow its users to access content and \ndata quickly but not vice versa.\nFew Examples of CDN Providers:RACKSPACE, AMAZON CLOUDFRONT, MICROSOFT AZURE CDN\nGOOGLE CLOUD CDN, MAX CDN, CLOUDFLARE\n\nTRADITIONAL CONTENT DELIVERY \nSYSTEMS\nProblem of pushing massive amounts of data from the Internet to the \nend user as fast as possible had to be solved. \n- The first Content Delivery Networks were built by Akamai \nTechnologies, Inc. based in Cambridge, Massachusetts. Their CDNs \nare responsible for 15-30% of global Internet traffic. They have over \n2200 Points of Presence in 120 countries and are affiliated with 1500 \nnetworks. \n- Companies that followed suit and also built their CDNs include \nAT&T, Telstra and Deutsche Telekom.\n\n", "hey have over \n2200 Points of Presence in 120 countries and are affiliated with 1500 \nnetworks. \n- Companies that followed suit and also built their CDNs include \nAT&T, Telstra and Deutsche Telekom.\n\nTRADITIONAL CONTENT DELIVERY \nSYSTEMS ORGANISED INTO 4 PERIODS\nPre-Formation\nPeriod\n- Gave rise to server farms, hierarchical caching, and improvements \nin Web servers and caching proxy deployment\n- Infrastructure development, mirroring, caching and multihoming\nFirst \nGeneration\n- CDNs focused primarily on dynamic and static content delivery\n- creation and the implementation of replicas, intelligent routing and edge \ncomputing methods\n- Apps and info were split across the servers.\nSecond \nGeneration\n- focused on Video-on-Demand\n- cleared a path for delivering content to mobile users\n- credited with the usage of P2P, cloud computing techniques to delivery and \nmaintain content\n\n", "Second \nGeneration\n- focused on Video-on-Demand\n- cleared a path for delivering content to mobile users\n- credited with the usage of P2P, cloud computing techniques to delivery and \nmaintain content\n\nTRADITIONAL CONTENT DELIVERY \nSYSTEMS ORGANISED INTO 4 PERIODS\nThird \nGeneration\n- driven by average users and regular individuals\n- Self-configuring, self-managing\n- Focus on quality of experience \n\nNEED FOR CONTENT ORGANIZATION\nAs more marketers publish more content, organization plays a\ngreater role. Let’s say you curate 10 pieces of content a day. In a\nyear, you may easily publish more than 3,600 pieces of content.\nNow that you have such a large volume, you can provide that\ncontent to your readers in interesting ways, through intelligent\norganization.\nLet’s take a look at a few outstanding ways that marketers are\norganizing their content online, with real world examples of what it\nlooks like.\n\n", "in interesting ways, through intelligent\norganization.\nLet’s take a look at a few outstanding ways that marketers are\norganizing their content online, with real world examples of what it\nlooks like.\n\nNEED FOR CONTENT ORGANIZATION\n1. Tagging\nTags are a common way to create a simple, non-hierarchical \ntaxonomy of your content. Tags are simply keywords and phrases \nthat are associated with each piece of content. For a single piece \nof content, they let the audience quickly understand the important \nconcepts captured in the content. In aggregate, they provide a \npowerful way to spot recent trends by viewing the most popular \ntags.\n\n1. EXAMPLE OF TAGGING\nginstitute.com/wpcontent/uploads/2012/09/de\nshpande-tag_cloud-f.jpg\nImage Source\n\n", "gregate, they provide a \npowerful way to spot recent trends by viewing the most popular \ntags.\n\n1. EXAMPLE OF TAGGING\nginstitute.com/wpcontent/uploads/2012/09/de\nshpande-tag_cloud-f.jpg\nImage Source\n\nNEED FOR CONTENT ORGANIZATION\n2. Grouping\nGrouping your related content serves two purposes: First, it helps\nreduce\nscreen\nclutter\nby\nbringing\ntogether\nsimilar\ncontent.\nSecondly,\ngrouping\nallows\nreaders\nto\nquickly\nfind\ndifferent\nperspectives about the same issue.\n\n2. EXAMPLE OF GROUPING\nginstitute.com/wpcontent/uploads/2012/09/de\nshpande_romney-f.jpg\nImage Source\n\nNEED FOR CONTENT ORGANIZATION\n3. RECOMMENDATIONS\nA great way to get people to consume additional content is to offer \nrecommendations based on their previous content consumption \npatterns.\nCompanies such as Netflix and Amazon employ sophisticated \ncollaborative filtering algorithms that deliver personalized \nrecommendations to every user.\n\n", " their previous content consumption \npatterns.\nCompanies such as Netflix and Amazon employ sophisticated \ncollaborative filtering algorithms that deliver personalized \nrecommendations to every user.\n\n3. EXAMPLE OF RECOMMENDATIONS\nginstitute.com/wpcontent/uploads/2012/09/de\nshpande_futurama-f.jpg\nImage Source\n\nNEED FOR CONTENT ORGANIZATION\n4. FACETS\nAnother technique to better organize content that is commonly \nemployed on e-commerce sites is to provide a faceted navigation \nthat lets readers quickly drill down to just the content in which they \nare interested.\n\n4. EXAMPLE OF FACETS\nginstitute.com/wpcontent/uploads/2012/09/de\nshpande-lctv-f.jpg\nImage Source\n\nNEED FOR CONTENT ORGANIZATION\n5. TRENDS HISTOGRAM\nGoogle Trends displays trend histograms which illustrate the search \nvolume and news reference volume of existing content over time.\nIn addition, it has special algorithms that highlight salient stories that \npertain to specific topics. \n\n", " which illustrate the search \nvolume and news reference volume of existing content over time.\nIn addition, it has special algorithms that highlight salient stories that \npertain to specific topics. \n\n5. EXAMPLE OF TRENDS HISTOGRAM\nginstitute.com/wpcontent/uploads/2012/09/de\nshpande-obama-f.jpg\nImage Source\n\nNEED FOR CONTENT ORGANIZATION\n6. TOPIC PAGES\nTopic pages are emerging as an easy way to organize your content \nby the topics that you have written about. Earlier last month, \nReadWriteWeb called Topic Pages the “next big thing.”\nSites such as Quora, Pinterest, and the New York Times are built on \ntopic pages, to name just a few examples. With topic pages, \nreaders can quickly view all the content pertaining to a specific \ntopic on a single page. In addition, topic pages are great for longtail search engine optimization.\n\nNEED FOR CONTENT ORGANIZATION\n7. TOPIC MAPS\nA fun way to visually organize your content is through topic maps.\n\n", "ngle page. In addition, topic pages are great for longtail search engine optimization.\n\nNEED FOR CONTENT ORGANIZATION\n7. TOPIC MAPS\nA fun way to visually organize your content is through topic maps.\n\n7. EXAMPLE OF TOPIC MAPS\nginstitute.com/wpcontent/uploads/2012/09/de\nshpande-silobreaker-f.jpg\nImage Source\n\nMERITS OF CMS\nQuick Development\nLess Backend Coding\nProvide built-in Page Builder\nEasy for non-technical Person\nSecurity\n\nMERITS OF CMS\nSEO Friendly\nImprove Customer Services\nReduces cost if you use some free open-sources\nFacilitates the implementation of important functionalities\nComplete control over the content \n\nDEMERITS OF CMS\nDependence on plugins and widgets\nHidden cost of plugins and widgets\nSite load speed\nMaintenance\nCan sustain limited number of users\n\n", "nctionalities\nComplete control over the content \n\nDEMERITS OF CMS\nDependence on plugins and widgets\nHidden cost of plugins and widgets\nSite load speed\nMaintenance\nCan sustain limited number of users\n\nDEMERITS OF CMS\nLimitation in functional requirements\nBack end functionalities are limited\nModifying and formatting the graphic images and tables is difficult\nUpdating WordPress version leads to loss of data, so a backup copy \nof the website is required.\n\nWHICH IS THE BEST CDN?\nYour organization’s needs\nUser geography\nSpeed and reliability\nCost and pricing models\nSpeed and reliability\nSecurity\nSupport\n\n", "QUESTION BANK\n1. Define CDN. 1-2 marks\n2. What is the goal of CDN? 1 mark\n3. What are the characteristics of CDN. 5 marks\n4. State any three advantages of CDN. 3 marks\n5. Where was the first CDN built? 1 mark\n6. List any two/four CDN Providers. 2 marks\n7. Write a note on CMS 3 marks\n8. Give two/four examples of CMS. 2 marks\n9. Differentiate between CDN and CMS. 3 marks\n10.Write a note on Traditional Content Delivery Systems. 3 marks\n11.Differentiate between four periods of Traditional Content Delivery Systems. 2 marks\n12.Why do we need to organize content on a website?1-2 marks\n13.Explain in brief by giving any five examples in which marketers/content organizers \norganise their website content? 3-5 marks\n14.What are the pros of a CMS? 3-5 marks\n15.What are the cons of a CMS? 3-5 marks\n16.As a marketer, on what basis would you decide a CDN? or What are the characteristics \none should look for while deciding on a CDN? 3-5 marks\n\n", "MS? 3-5 marks\n15.What are the cons of a CMS? 3-5 marks\n16.As a marketer, on what basis would you decide a CDN? or What are the characteristics \none should look for while deciding on a CDN? 3-5 marks\n\nREFERENCES\ndisadvantages-of-cms\nsystem-advantages-disadvantages/\ndelivery-network-explained/\ncdn-and-cms", "UNIT 10 Joomla\nMs. Shruthi Nair\nAssistant Professor\nSt. Xavier’s College, \nMapusa-Goa\n\n●\nJoomla is an open source Content Management System (CMS), which is used \nto build websites and online applications. \n●\nIt is free and extendable which is separated into front-end and back-end \ntemplates (administrator). \n●\nJoomla is developed using PHP, Object Oriented Programming, software \ndesign patterns and MySQL (used for storing the data).\nIntroduction\n\n●\nJoomla is based on Mambo CMS which was developed by an Australian \ncompany in 2001 and initially released on August 17, 2005. \n●\nThe official version of Joomla 1.0 was released on September 22, 2005.\nHistory\n\nFeatures\n\n", "●\nUser Manager − It allows managing the user information such as permission to edit, access, publish, \ncreate or delete the user, change the password and languages. The main part of the user manager \nis Authentication.\n●\nContent Manager − It allows managing the content using WYSIWYG editor to create or edit the content \nin a very simple way.\n●\nBanner Manager − It is used to add or edit the banners on the website.\n●\nTemplate Manager − It manages the designs that are used on the website. The templates can be \nimplemented without changing the content structure within a few seconds.\n●\nMedia Manager − It is the tool for managing the media files and folder in which you can easily upload, \norganize and manage your media files into your article editor tool.\n●\nContact Manager − It allows to add contacts, managing the contact information of the particular users.\n●\nWeb Link Manager − The link resource is provided for user of the site and can be sorted into categories.\n●\n", "ger − It allows to add contacts, managing the contact information of the particular users.\n●\nWeb Link Manager − The link resource is provided for user of the site and can be sorted into categories.\n●\nSearch − It allows users to search the appropriate information on the site. You can use smart indexing, \nadvanced search options, auto suggest searches to make Joomla search best.\n●\nMenu Manager − It allows to create menus and menu items and can be managed subsequently. You can \nput menu in any style and in multiple places.\n●\nRSS − It stands for Really Simple syndication which helps your site contents and RSS files to be \nautomatically updated.\nFeatures\n\n", "●\nIt is an open source platform and available for free.\n●\nJoomla is designed to be easy to install and set up even if you're not an advanced user.\n●\nSince Joomla is so easy to use, as a web designer or developer, you can quickly build \nsites for your clients. With minimal instructions to the clients, clients can easily manage \ntheir sites on their own.\n●\nIt is very easy to edit the content as it uses WYSIWYG editor \n(What You See Is What You Get is a user interface that allows the user to directly \nmanipulate the layout of the document without having a layout command).\n●\nIt ensures the safety of data content and doesn't allow anyone to edit the data.\n●\nBy default, Joomla is compatible with all browsers.\n●\nThe templates are very flexible to use.\n●\nMedia files can be uploaded easily in the article editor tool.\n●\nProvides easy menu creation tool.\nAdvantages\n\n", "ult, Joomla is compatible with all browsers.\n●\nThe templates are very flexible to use.\n●\nMedia files can be uploaded easily in the article editor tool.\n●\nProvides easy menu creation tool.\nAdvantages\n\n●\nIt gives compatibility problem while installing several modules, \nextensions and plugins simultaneously.\n●\nPlugins and modules are not free in Joomla.\n●\nDevelopment is too difficult to handle when you want to change the \nlayout.\n●\nJoomla is not much SEO (Search Engine Optimization) friendly.\n●\nIt makes website heavy to load and run.\nDisadvantages\n\n●\nCorporate web sites or portals\n●\nCorporate intranets and extranets\n●\nOnline magazines, newspapers, and publications\n●\nE-commerce and online reservations\n●\nGovernment applications\n●\nSmall business web sites\n●\nNon-profit and organizational web sites\n●\nCommunity-based portals\n●\nSchool and religious web sites\n●\nPersonal or family homepages\nReal World Examples\n\n", "rnment applications\n●\nSmall business web sites\n●\nNon-profit and organizational web sites\n●\nCommunity-based portals\n●\nSchool and religious web sites\n●\nPersonal or family homepages\nReal World Examples\n\n●\nIf you want to publish your website online, then you are required to get a web hosting \nservice. \n●\nA web hosting is a service that allows users to post a website or web pages onto the \ninternet. \n●\nWebsite data is hosted or stored on special computers known as servers.\n●\nTo access any website, the user needs to type the website address (Domain Address) into \nthe browser's address bar. \n●\nAfter that, the browser will connect the user to the server, and the webpage will be \ndisplayed through the browser.\nWhat is Hosting?\n\n", "ite address (Domain Address) into \nthe browser's address bar. \n●\nAfter that, the browser will connect the user to the server, and the webpage will be \ndisplayed through the browser.\nWhat is Hosting?\n\n●\nJoomla is known as the second most popular CMS platform after WordPress, \nand it helps users to create and build freely hosted Joomla websites. \n●\nBy giving an option to have a free hosted site for an unlimited time, Joomla \naims to become more popular and increase its user base. \n●\nJoomla hosting is a web hosting plan that provides compatibility with the \ncontent management system Joomla. \n●\nFor businesses and individuals that decide to build their website using Joomla, a \nJoomla hosting plan is a logical choice to ensure that your web hosting plan \nworks well with the main system you use to run and maintain your website.\nWhat is Joomla Hosting?\n\n", "bsite using Joomla, a \nJoomla hosting plan is a logical choice to ensure that your web hosting plan \nworks well with the main system you use to run and maintain your website.\nWhat is Joomla Hosting?\n\n1. Installation will be easy.\n○\nAdding Joomla to a Joomla hosting account will typically mean one-click installation. \n○\nYou don’t have to worry about a lengthy process of connecting your Joomla account to your web \nhosting one. \n○\nWithin a couple of minutes, everything will be in place for you use and you’ll be ready to publish \nyour Joomla-built website to the web.\n2. Adding Joomla to your account will be free.\n○\nWhile web hosting plans come at a cost, when you use Joomla hosting you can be confident that \nusing Joomla with your web hosting plan won’t add any additional cost or fees to your subscription. \n○\nYour web hosting cost will remain the amount you agreed to for the plan, even after you connect \nyour accounts.\n5 Benefits of the Joomla Hosting Platform\n\n", "3. You can count on compatibility.\n○\nThe last thing you want is to figure out the web hosting plan you choose has compatibility \nissues with the CMS you built your entire website on. \n○\nWhen you choose Joomla hosting for a website built with Joomla, you know right from the \nstart that the two accounts will work well together. \n○\nYour web hosting plan will have no problem accommodating your Joomla site, and your work \nin Joomla won’t cause any problems with your web hosting.\n4. Making updates will be intuitive.\n○\nOne of the big benefits of using Joomla is that it makes all the ongoing updates you’ll need to \nmake to your website - big and small - easy to do yourself, without having to call on a web \ndevelopment professional to help. \n○\nWith the right Joomla hosting plan, you can ensure that all the updates you make to your \nwebsite are still easy with Joomla, and any updates you need to make to your hosting plan will \nbe simple and intuitive as well.\nContd.\n\n", "5. You have two sources for helpful support.\n○\nIf you’re not an expert on building and running a website - and maybe even if you are - you’ll \nhit up against issues working on your website where you need help. When you use Joomla to \nbuild your website, you gain access to a large community of Joomla users who provide help \nand support in the Joomla forum, in Joomla user groups that meet around the world, and at a \nnumber of events and conferences that are all about Joomla. And that’s in addition to the \neducational materials like courses and tutorials that are readily available online.\n○\nWith a good Joomla hosting provider, you also gain access to a committed customer support \nteam who can help you out with many additional aspects of keeping your website working the \nway you want. This is especially valuable if you go with a web hosting provider that offers \n24/7 customer support or provides additional skilled services to help out with things \nlike SEO, PPC, or web design.\n○\n", ". This is especially valuable if you go with a web hosting provider that offers \n24/7 customer support or provides additional skilled services to help out with things \nlike SEO, PPC, or web design.\n○\nEven with an intuitive web hosting plan and CMS like Joomla, many aspects of running a \nwebsite can be difficult, so having multiple sources you can turn to for help is a valuable \nbenefit.\nContd.\n\n", "1. Scalability\n●\nWhen choosing a Joomla hosting provider, you have to think about what you need today, but you’ll \nmake a better long-term choice if you also consider what you could need in the future. \n●\nDetermine whether the web hosting company you go with provides room to grow. \n●\nWill it be easy to upgrade your plan down the line if your website starts getting a lot more traffic, \nor if you decide to expand your website to include features that require a higher level of \nbandwidth?\n●\nFigure out what type of plan best meets your needs today, but also look at some of the other plan \noptions your provider offers. Do they look like a good fit for where you want your Joomla website \nto be in five years.\n5 Things to Look for in a Joomla Hosting Plan\n\n", "2. 24/7 Support\n●\nA good web hosting provider will make a lot of what you need to do through your web hosting account simple and \nintuitive. \n●\nBut nonetheless, you may well have times where you need a little help figuring out how to do something or fixing a \nproblem that’s not working right. When that happens, you want to get ahold of someone that knows how to help and can \nprovide the information you need fast.\n●\nAny web hosting provider you choose (as long as they offer paid plans), should provide customer support. \n●\nBut also check to see if the support they provide is available 24 hours a day, seven days a week.\n●\nAnd check some hosting reviews to see if their customer support team has a reputation for having a good track record. \n●\nThe quality and accessibility of the customer support you receive can make a big difference in how satisfied you are with \na Joomla hosting provider.\n3. 99% Uptime\n●\n", "or having a good track record. \n●\nThe quality and accessibility of the customer support you receive can make a big difference in how satisfied you are with \na Joomla hosting provider.\n3. 99% Uptime\n●\nUptime is the term used in the web hosting industry to describe the amount of time your website is accessible to visitors \non the web. \n●\nBecause web hosting servers occasionally have to go offline for maintenance, no company can promise 100% uptime. \nAnd web servers can go offline for a number of additional reasons, such as hackers, improper maintenance, parts breaking, \nor web servers being affected physically by extreme weather conditions like flooding.\n●\nPart of what you pay a Joomla web hosting provider for is to keep their web servers well maintained and working \nconsistently. The most reliable companies put a lot of work into delivering on that. Look for a web hosting company that \noffers at least 99% uptime, but ideally promises closer to 99.9%\nContd.\n\n", "4. Security\n●\nWebsite security is an issue every website owner has to prioritize today. \n●\nData breaches and hacked websites are an all too common reality, and often websites built using a \nCMS are a particular target since hackers know how to find vulnerabilities in the CMS code. \n●\nWhile there are a number of steps you can take to make your website more secure from hackers, \nincluding keeping your Joomla version up to date, one of the best ways to ensure website security is \nchoosing the right web hosting provider,Check that your Joomla hosting provider has a reputation for \nusing strong firewalls to keep their web servers protected, and that they offer key security features like \nan SSL certificate and security software.\n5. Affordability\n●\nWeb hosting is a necessary expense if you want to have a website, but it doesn’t have to be a large \none. \n●\nA good Joomla hosting plan can start at less than $3 a month for shared web hosting, which is usually \na good choice for new websites.\n●\n", " to have a website, but it doesn’t have to be a large \none. \n●\nA good Joomla hosting plan can start at less than $3 a month for shared web hosting, which is usually \na good choice for new websites.\n●\nWhen you’re considering your options, you have to think about what you can afford. In some cases, \npaying a little more can be worth it for what you get for the extra money - such as choosing a web \nhosting plan that includes features you need like an SSL certificate or a website builder. So consider \ncarefully what you’re getting for the cost, and make sure it fits in your website budget.\nContd.\n\n", "●\nThere are some limitations on the hardware configuration provided in the free Joomla hosting service, \nas follows:\n●\n100% Core Joomla or WordPress (Unrestricted)\n●\n500MB Disk Space\n●\n1 CPU Core\n●\n1 GB RAM\n●\nFree Subdomain\n●\nFTP/MySQL Access\nFree Joomla Hosting Specifications\n\n", "●\nJoomla is a great platform to build almost any kind of website. It provides a lot of great tools in the admin \npanel. Once you have completed the installation of Joomla. You can start working to make a website of \nyour own.\n●\nBefore you start building your website, you have to log in to Joomla to access its admin panel. The admin \npanel is the area where all of the work for the website is completed. Every task from creating content to \nperforming various maintenance tasks is available with just a click of the mouse.\nJoomla Admin URL\n●\nBy default, Joomla installs the admin panel, which can be accessed only through the URL: \n\" Here, you need to change the 'yourdomain.com' with your \nwebsite domain or public IP address (localhost).\n●\nIn other words, you are required to type the website address or localhost, followed by \"/administrator\" to \naccess the Joomla admin area. It will provide the login screen which will look like the screenshot given \nbelow:\nJoomla Login\n\n", "●\nType your username and password and click on the \"Log in\" button to continue. If you have entered \nthe correct credential details, you will be redirected into the admin panel, where you can perform the \nchanges to your site.\nReset Joomla Admin Password\n●\nSometimes, people create elaborate usernames and passwords to ensure security for their websites. \nUnfortunately, they forget the credential details and don't get access to the admin panel of the site. It's \nquite embarrassing when you create a site but can't make changes because of the wrong credentials. \nHowever, you can change or reset the username or password easily by following some steps. It is not \ndifficult for resetting or retrieving the username or password with Joomla.\n●\nIn the Joomla login screen, there are question mark signs next to both the username and password \nfields.\n●\nIf you click any of these icons, you will be redirected into the page where you have to enter the email \n", " login screen, there are question mark signs next to both the username and password \nfields.\n●\nIf you click any of these icons, you will be redirected into the page where you have to enter the email \naddress associated with your user account. If you enter the correct email address, you will receive the \nemail with the instructions to reset your credentials\nContd.\n\n", "●\nAs soon as you log in to the Joomla admin panel, you will be redirected into the Control \nPanel (Dashboard) screen. \n●\nTo access the control panel from any other page in the back-end, navigate to the \"System \n> Control Panel\" from the drop-down menu of Joomla Administrator Panel. \n●\nIt contains several default features and functions of Joomla to access through clickable \nicons, menu bars, etc. It will look like this:\nJoomla Control Panel\n\n", "●\nThere is a side-bar containing several options which are used to access several functions such as Articles \nmanager, Media manager, Menus, Modules, Users, Templates, Configurations, and Extensions. Check out \nthe following list explaining these options and their functions:\nArticle Content\nThere are four icons under the CONTENT section as shown below −\nAdd New Article − It creates a new article page.\nArticle Manager − It manages all your present articles.\nCategory Manager − It creates new categories and helps in publishing/unpublishing the categories.\nMedia Manager − It manages the files by uploading various new files or deleting the existing ones on \nyour web server.\nStructure Format\nIn STRUCTURE section, there are two groups of icons −\nMenu Manager − Menu manager allows creating custom menus for your website and navigating through \nyour website.\nModule Manager − It manages the modules such as location and function of modules that are installed \non site.\nContd.\n\n", "User Information\nUnder USERS section, there is one icon located −\nUser Manager − It manages the user information, which allows creating or deleting the user, changing \npasswords, time and languages. You can also assign the user to User Groups.\nSet the configuration\n●\nThree icons are located under the CONFIGURATION section as given below −\nGlobal Configuration − This is an important part in the Joomla back-end. Any changes made in this \nconfiguration, will affect the entire website.\nTemplate Manager − It manages the templates used in the website.\nLanguage Manager − It manages installed language by setting the default language for your site.\nInstall Extension\n●\nThere are many Extensions available in Joomla. You can install different types of extensions to extend the \nfunctionality of the site.\nContd.\n\n", " the default language for your site.\nInstall Extension\n●\nThere are many Extensions available in Joomla. You can install different types of extensions to extend the \nfunctionality of the site.\nContd.\n\nMaintenance\no\nIn MAINTENANCE section, there are two icons located −\nJoomla is up-to-date − It views the current update status of the Joomla installation.\nAll extensions are up-to-date − It views the current update status of the Joomla extension.\nLogged-In User\n○\nIt shows the administrator name who has logged in to the Joomla site.\nPublished Articles\n○\nIt shows the published articles and also shows the present article, that you have published.\nInformation of Sites\n○\nIt displays the details of the site such as OS name, version of PHP and MySQL etc and also \nshows the number of users that are using this site.\nContd.\n\n", "that you have published.\nInformation of Sites\n○\nIt displays the details of the site such as OS name, version of PHP and MySQL etc and also \nshows the number of users that are using this site.\nContd.\n\n●\nState and explain any 6 features of Joomla.\n●\nGive advantages and disadvantages of Joomla CMS.\n●\nGive any 6 real world example where Joomla CMS can be used.\n●\nWhat is Joomla hosting?\n●\nGive any 5 Benefits of the Joomla Hosting Platform.\n●\nWhat are the important things that you need to consider while investing in Joomla Hosting Plan.?\n●\nWhat are the limitations on the hardware configuration provided in the free Joomla hosting service?\n●\nExplain some of the features and its function listed under Joomla control panel/Dashboard.\n●\nExplain article content, structure format, user information and Set the configuration option of Joomla \ncontrol panel/Dashboard.\n●\nWrite a short note on Joomla login.\nQUESTIONS\n\n●\n●\n●\n●\n●\nREFERENCE"], "sources": ["Unit 10_Building Websites using Joomla (2) - Copy.pptx", "Unit 10_Building Websites using Joomla (2) - Copy.pptx", "Unit 10_Building Websites using Joomla (2) - Copy.pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 8__WIX CMS PPT (1) (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 6__CSS - Website design using css (1).pptx", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "Unit 2[Planning and Developing Dynamic Web Content Sites ]_ModifiedVersion1.0_2.pdf", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "moodle (1) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 5__Building an administration of PrestaShop based website (2) (1).pptx", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "Unit 3[Building and Administrating a wordpress blog site]_2.pdf", "updated Unit 11[ComparisionOfVariousCMSTools] (1).pptx", "updated Unit 11[ComparisionOfVariousCMSTools] (1).pptx", "updated Unit 11[ComparisionOfVariousCMSTools] (1).pptx", "updated Unit 11[ComparisionOfVariousCMSTools] (1).pptx", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "joomla plugin Unit 10_3 - Copy.pdf", "Unit 4_SocialGo (1).pptx", "Unit 4_SocialGo (1).pptx", "Unit 4_SocialGo (1).pptx", "Unit 4_SocialGo (1).pptx", "UNIT 7_Creating and Maintaining a Wikimedia site_2.pdf", "UNIT 7_Creating and Maintaining a Wikimedia site_2.pdf", "UNIT 7_Creating and Maintaining a Wikimedia site_2.pdf", "UNIT 7_Creating and Maintaining a Wikimedia site_2.pdf", "UNIT 7_Creating and Maintaining a Wikimedia site_2.pdf", "UNIT 7_Creating and Maintaining a Wikimedia site_2.pdf", "UNIT 7_Creating and Maintaining a Wikimedia site_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "Unit 1[Introduction to Content Managent Systems]_ModifiedVersion1.0_2.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf", "unit 10 Joomla_3.pdf"]}